{
    "id": "c6cf0f1e7dd2bb5a4e9b58655f298a0a5291759105a034948f27dbc600252d5e",
    "data": {
        "text": "Mandvi Cooperative Bank Limited V. Nimesh B. Thakore. \nAftab Alam, J.- Leave granted. In these appeals we are required to consider the special provisions laid down by Section 145 of the Negotiable Instruments Act, 1881 (\"the Act\", hereinafter) for a dishonoured cheque trial and to consider how far certain assertions made by the accused are in accordance with the provi- sions contained in the two sub-sections of that section. \n2. The High Court had before it a large number of writ petitions and applications under Section 482 of the Code of Criminal Procedure. Most of those petitions were filed on behalf of the accused but a few were also at the instance of the complainants. On the basis of the grievances made and reliefs prayed for in those peti- tions the High Court framed the following two questions as arising for its consideration:\n    \"(A) Whether sub-section (2) of Section 145 of the Negotiable Instruments Act, 1881 (for short 'the Act') confers an unfettered right on the complainant and the accused to apply to the court seeking direction to give oral exami- nation-in-chief of a person giving evidence on affidavit, even in respect of the facts stated therein and that if such a right is exercised, whether the court is obliged to examine such a person in spite of the mandate of Section 145(1) of the Act? \n     (B) Whether the provisions of Section 145 of the Act, as amended by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002 (for short 'the amending Act of 2002') are applicable to the complaints under Section 138 of the Act pending on the date on which the amendment came into force? In other words, do the amended provisions of Sections 145(1) and (2) of the Act operate retrospectively? \n3. Answering the questions after a detailed and careful consideration of all the relevant provisions and earlier decisions of courts, the High Court held that the person (the complainant or his witness) giving evidence on affidavit may be summoned by the court for putting questions as envisaged under Section 165 of the Evidence Act, 1872 (vide para 24 of the judgment). He would also be summoned on an application made by the accused but the right of the accused is limited to cross-examination of the witness. In terms of Section 145(2) the accused can undoubtedly cross-examine a person whose evidence is given on affidavit but the ac- cused cannot insist that the witness, on coming to court, should first depose in examination-in-chief even in respect of matters which are already stated by him on affidavit (vide para 25 of the judgment). \n4. The High Court further explained that for the prosecution the occasion to summon any of its witnesses who have given their evidence on affidavit may arise in two ways. The prosecution may summon a person who has given his evidence on affidavit and has been cross-examined for re-examination. This right of the prosecution, the High Court observed, was not in dispute before it. The prosecution may also have to sum- mon a witness whose evidence is given on affidavit in case objection is raised by the defence regarding the va- lidity and/or sufficiency of the proof of some document(s) submitted along with the affidavit. In that event the witness may be summoned to appear before the court to cure the defect and to have the document(s) properly proved by following the correct legal mode (vide para 26 of the judgment).\n5. The High Court then considered the claim of the accused that any evidence in defence, like the complainant's evidence, may also be given on affidavit. It upheld the claim observing as follows:\n     \"... Merely because, Section 145(1) does not expressly permit the accused to do so, does not mean that the Magistrate cannot allow the accused to give his evidence on affidavit by applying the same analogy unless there is just and reasonable ground to refuse such permission. There is no express bar on the accused to give evidence on affidavit either in the Act or in the Code........ I find no justified reason to refuse permission to the accused to give his evidence on affidavit subject to the provisions contained in Sections 315 and 316 of the Code.\" \n6. Coming then to Question B, the High Court had no difficulty in holding that the provisions of sub-sec- tions (1) and (2) of Section 145 were not substantive but only procedural in nature and, therefore, those provisions would be applicable to the cases pending on the date they came into force. Apart from considering the two questions the High Court also laid down, on the request of the parties, a number of guidelines [vide sub-paras (a) to (r) of para 45 of the judgment] in regard to the procedure that the trial court, the com- plainant and the accused should follow in a dishonoured cheque trial on a complaint made under Section 138 of the Act. We may have to refer to some of those guidelines later, at an appropriate place in this judgment. \n7. The High Court judgment has given rise to these seven appeals, in which the following three issues arise for consideration by this Court:\n     1. The extent of the right of the accused under Section 145(2) of the Act: whether the right of the accused is limited to cross-examination of any person giving evidence on affidavit or is it open to the accused to insist that notwith- standing the evidence earlier given on affidavit, on coming to the court the complainant or his witness should first give deposition in examination-in-chief before being cross-examined by him? [Appeals arising from SLP (Crl.) No. 4760 of 2006, SLP (Crl.) No. 5689 of 2006, SLP (Crl.) No. 1106 of 2007, SLP (Crl.) No. 6442 of 2007, SLP (Crl.) No. 6443 of 2007, SLP (Crl.) No. 6703 of 2007.]\n     2. Whether the provisions of sub-sections (1) and (2) of Section 145 of the Act would apply to proceedings that were pending on 6-2-2003, the date on which those provisions were inserted in the Act? [Appeal arising from SLP (Crl.) No. 4760 of 2006.]\n     3. Whether the right to give evidence on affidavit as provided to the complainant under Section 145(1) of the Act is also available to the accused? [Appeal arising from SLP (Crl.) No. 3915 of 2006.]\n8. For a proper appreciation of the issues it would be necessary to examine the relevant legal provisions and to ascertain the objects and reasons for which those provisions were brought into existence by making amendments in the Negotiable Instruments Act, 1881. The Negotiable Instruments Act was amended first by the Banking, Public Financial Institutions and Negotiable Instruments Laws (Amendment) Act, 1988 and a second time by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002. \n9. The first amendment inserted Chapter XVII in the Act, comprising Sections 138 to 142. Section 138 made, for the first time in the legislative history of the country, the issuance of a cheque by any person in discharge of any debt or liability owed by him to its holder, that was not honoured by the banker because of insuffi- ciency of funds in the account, a penal offence for the drawer that would make him liable to punishment with imprisonment that might extend to one year (now, two years after the second amendment with effect from 6- 2-2003) or with fine that might extend to twice the amount of the cheque or both; the four clauses of the pro- viso then laid down the preconditions to attract the section, as safeguards for the honest drawer. \n10. Section 139 created a presumption (rebuttable!) that the cheque was issued by the drawer in discharge of any debt or liability owed by him to its holder. Section 140 provided that it would not be open to the accused in a prosecution under Section 138 to take the plea that when he issued the cheque he had no reason to be- lieve that on presentation, the cheque may be dishonoured for the reasons stated in that section. Section 141 dealt with offences by companies. Section 142 laid down the conditions subject to which alone the court would take cognizance of any offence punishable under Section 138 of the Act. \n11. The Statement of Objects and Reasons appended to the Bill explaining the provisions of the new Chapter stated as follows:\n     \"This clause [Clause (4) of the Bill] inserts a new Chapter XVII in the Negotiable Instruments Act, 1881. The provi- sions contained in the new Chapter provide that where any cheque drawn by a person for the discharge of any lia- bility is returned by the bank unpaid for the reason of the insufficiency of the amount of money standing to the credit of the account on which the cheque was drawn or for the reason that it exceeds the arrangements made by the drawer of the cheque with the bankers for that account, the drawer of such cheque shall be deemed to have committed an offence. In that case, the drawer, without prejudice to the other provisions of the said Act, shall be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to twice the  punishable with imprisonment for a term which may extend to one year, or with fine which may extend to twice the amount of the cheque, or with both. \n     The provisions have also been made that to constitute the said offence:\n     (a) such cheque should have been presented to the bank within a period of six months of the date of its drawal or within the period of its validity, whichever is earlier; and      (b) the payee or holder in due course of such cheque should have made a demand for the payment of the said amount of money by giving a notice, in writing, to the drawer of the cheque within fifteen days of the receipt of the information by him from the bank regarding the return of the cheque unpaid; and      (c) the drawer of such cheque should have failed to make the payment of the said amount of money to the payee or the holder in due course of the cheque within fifteen days of the receipt of the said notice. \nIt has also been provided that it shall be presumed, unless the contrary is proved, that the holder of such cheque re- ceived the cheque in the discharge of a liability. Defences which may or may not be allowed in any prosecution for such offence have also been provided to make the provisions effective. Usual provision relating to offences by com- panies has also been included in the said new Chapter. In order to ensure that genuine and honest bank customers are not harassed or put to inconvenience, sufficient safeguards have also been provided in the proposed new Chapter. Such safeguards are:\n     (a) that no court shall take cognizance of such offence except on a complaint, in writing, made by the payee or the holder in due course of the cheque;\n     (b) that such complaint is made within one month of the date on which the cause of action arises; and      (c) that no court inferior to that of a Metropolitan Magistrate or a Judicial Magistrate or a Judicial Magistrate of the First Class shall try any such offence.\"\n12. The speech of the Minister of Finance on 2-12-1988 in course of the debate on the Bill in the Lok Sabha tells us that Chapter XVII was inserted in the Act, in light of the report submitted in the year 1975 by the Committee on Banking Laws headed by Dr. Rajamannar. It appears that in the course of the debate some Members had expressed the view that the provisions of Chapter XVII sought to be inserted in the Act, con- tained very abnormal, rather very dangerous provisions, in that a kind of civil liability is supposed to be con- verted into a kind of criminal act which would have far-reaching consequences. \n13. Dispelling the apprehensions of those Members the Minister pointed out that the proposed amendments were along the same lines as the law prevailing in other countries such as UK, USA, Belgium, Portugal, Argentina, etc. Further, in regard to the object of the provisions, the Minister stated as follows:\n     \"In fact, the whole purpose of bringing about this provision is to make the drawing of cheque a regular mode of payment. Unfortunately, today if a cheque is given to a party, they will not consider it a sufficient means of pay- ment, they will insist that unless the cheque is encashed, they will not take that as a kind of payment made.\"\n    (emphasis added)\n14. The Minister then elaborated on the safeguards provided in the law to save an honest drawer from com- ing under the rigours of the section due to any bona fide mistake and finally went on to say as follows:\n     \"But in spite of time for payment and all other provisions that are made, if the party is not able to make good the amount of money which he owes to a particular party and in spite of the notice also he does not act, the conclusion is inescapable that he will be prosecuted, legal action will have to be taken. It is for the court to take a decision, whether he be imprisoned for one year, or double the amount that would be paid as fine or both things will have to be taken together. Ultimately, it is for the court to take a decision. But these are the provisions which have been provided for so that the parties drawing the cheques are careful enough to see that there are enough resources available in their bank account and if a cheque is drawn, it will not be returned.\"\n    (emphasis added)\n15. The provisions of the newly inserted Chapter XVII, on coming into force with effect from 1-4-1989, brought in a veritable deluge of cases in the criminal court system. In the metropolitan cities and the com- mercial centres of the country, it almost appeared that the main function of the Magistrate's court was to re- cover monies on behalf of parties on the wrong end of the commercial transactions that had gone sour. \n16. Complaints under Section 138 of the Act came to be filed in such large numbers that it became impossible for the courts to handle them within a reasonable time and it also had a highly adverse effect on the courts' normal work in ordinary criminal matters. A remedial measure was urgently required and the legislature took action by introducing further amendments in the Act by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002. The 2002 Amendment inserted in the Act for the first time Sections 143 to 147 besides bringing about a number of changes in the existing provisions of Sections 138 to 142.\n17. Section 143 gave to the court the power to try cases summarily; Section 144 provided for the mode of ser- vice of summons; Section 145 made it possible for the complainant to give his evidence on affidavit; Section 146 provided that the bank's slip would be prima facie evidence of certain facts and Section 147 made the of- fences under the Act compoundable.\n18. The Statement of Objects and Reasons appended to the Bill stated as follows:\n     \"The Negotiable Instruments Act, 1881 was amended by the Banking, Public Financial Institutions and Negotiable Instruments Laws (Amendment) Act, 1988 wherein a new Chapter XVII was incorporated for penalties in case of dishonour of cheques due to insufficiency of funds in the account of the drawer of the cheque. These provisions were incorporated with a view to encourage the culture of use of cheques and enhancing the credibility of the in- strument. The existing provisions in the Negotiable Instruments Act, 1881, namely, Sections 138 to 142 in Chapter XVII have been found deficient in dealing with dishonour of cheques. Not only the punishment provided in the Act has proved to be inadequate, the procedure prescribed for the courts to deal with such matters has been found to be cumbersome. The courts are unable to dispose of such cases expeditiously in a time-bound manner in view of the procedure contained in the Act. \n2. A large number of cases are reported to be pending under Sections 138 to 142 of the Negotiable Instruments Act in various courts in the country. Keeping in view the large number of complaints under the said Act pending in var- ious courts, a working group was constituted to review Section 138 of the Negotiable Instruments Act, 1881 and make recommendations as to what changes were needed to effectively achieve the purpose of that section. \n3. The recommendations of the Working Group along with other representations from various institutions and or- ganisations were examined by the Government in consultation with Reserve Bank of India and other legal experts, and a Bill, namely, the Negotiable Instruments (Amendment) Bill, 2001 was introduced in the Lok Sabha on 24-7- 2001. The Bill was referred to the Standing Committee on Finance which made certain recommendations in its re- port submitted to Lok Sabha in November 2001. \n4. Keeping in view the recommendations of the Standing Committee on Finance and other representations, it has been decided to bring out, inter alia, the following amendments in the Negotiable Instruments Act, 1881, namely:\n     ___      (i) to increase the punishment as prescribed under the Act from one year to two years;\n     (ii) to increase the period for issue of notice by the payee to the drawer from 15 days to 30 days;\n     (iii) to provide discretion to the court to waive the period of one month, which has been prescribed for taking cog- nizance of the case under the Act;\n     (iv) to prescribe procedure for dispensing with preliminary evidence of the complainant;\n     (v) to prescribe procedure for servicing of summons to the accused or witness by the court through speed post or empanelled private couriers;\n     (vi) to provide for summary trial of the cases under the Act with a view to speeding up disposal of cases;\n     (vii) to make the offences under the Act compoundable;\n     (viii) to exempt those Directors from prosecution under Section 141 of the Act who are nominated as Directors of a company by virtue of their holding any office or employment in the Central Government or State Government or a financial corporation owned or controlled by the Central Government, or the State Government, as the case may be;\n     (ix) to provide that the Magistrate trying an offence shall have power to pass sentence of imprisonment for a term exceeding one year and amount of fine exceeding five thousand rupees;\n     (x) to make the Information Technology Act, 2000 applicable to the Negotiable Instruments Act, 1881 in relation to electronic cheques and truncated cheques subject to such modifications and amendments as the Central Government, in consultation with the Reserve Bank of India, considers necessary for carrying out the purposes of the Act, by notification in the Official Gazette; and      (xi) to amend definitions of 'bankers' books' and 'certified copy' given in the Bankers' Books Evidence Act, 1891.\n5. The proposed amendments in the Act are aimed at early disposal of cases relating to dishonour of cheques, en- hancing punishment for offenders, introducing electronic image of a truncated cheque and a cheque in the elec- tronic form as well as exempting an official nominee Director from prosecution under the Negotiable Instruments Act, 1881. \n6. The Bill seeks to achieve the above objects.\"\n     (emphasis added)\n19. Though, in these appeals, we are mainly concerned with the provisions of Section 145, it would be useful here to take a look at all the five sections introduced by the 2002 Amendment:\n     \"143. Power of court to try cases summarily.(1) Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), all offences under this Chapter shall be tried by a Judicial Magistrate of the First Class or by a Metropolitan Magistrate and the provisions of Sections 262 to 265 (both inclusive) of the said Code shall, as far as may be, apply to such trials:\n     Provided further that when at the commencement of, or in the course of, a summary trial under this section, it ap- pears to the Magistrate that the nature of the case is such that a sentence of imprisonment for a term exceeding one year may have to be passed or that it is, for any other reason, undesirable to try the case summarily, the Magistrate shall after hearing the parties, record an order to that effect and thereafter recall any witness who may have been examined and proceed to hear or rehear the case in the manner provided by the said Code. \n     (2) The trial of a case under this section shall, so far as practicable, consistently with the interests of justice, be con- tinued from day to day until its conclusion, unless the court finds the adjournment of the trial beyond the following day to be necessary for reasons to be recorded in writing. \n     (3) Every trial under this section shall be conducted as expeditiously as possible and an endeavour shall be made to conclude the trial within six months from the date of filing of the complaint. \n     144. Mode of service of summons.(1) Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), and for the purposes of this Chapter , a Magistrate issuing a summons to an accused or a witness may direct a copy of summons to be served at the place where such accused or witness ordinarily resides or carries on business or personally works for gain, by speed post or by such courier services as are approved by a Court of Session. \n     (2) Where an acknowledgment purporting to be signed by the accused or the witness or an endorsement purported to be made by any person authorised by the Postal Department or the courier services that the accused or the wit- ness refused to take delivery of summons has been received, the court issuing the summons may declare that the summons has been duly served. \n     145. Evidence on affidavit.(1) Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), the evidence of the complainant may be given by him on affidavit and may, subject to all just exceptions be read in evidence in any enquiry, trial or other proceeding under the said Code. \n     (2) The court may, if it thinks fit, and shall, on the application of the prosecution or the accused, summon and ex- amine any person giving evidence on affidavit as to the facts contained therein. \n     146. Bank's slip prima facie evidence of certain facts.-The court shall, in respect of every proceeding under this Chapter, on production of bank's slip or memo having thereon the official mark denoting that the cheque has been dishonoured, presume the fact of dishonour of such cheque, unless and until such fact is disproved. \n     147. Offences to be compoundable.-Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), every offence punishable under this Act shall be compoundable.\" \n20. It may be noted that the provisions of Sections 143, 144, 145 and 147 expressly depart from and override the provisions of the Code of Criminal Procedure, the main body of adjective law for criminal trials. The provisions of Section 146 similarly depart from the principles of the Evidence Act. Section 143 makes it pos- sible for the complaints under Section 138 of the Act to be tried in the summary manner, except, of course, for the relatively small number of cases where the Magistrate feels that the nature of the case is such that a sentence of imprisonment for a term exceeding one year may have to be passed or that it is, for any other rea- son, undesirable to try the case summarily. \n21. It is, however, significant that the procedure of summary trials is adopted under Section 143 subject to the qualification \"as far as possible\", thus, leaving sufficient flexibility so as not to affect the quick flow of the qualification \"as far as possible, thus, leaving sufficient flexibility so as not to affect the quick flow of the trial process. Even while following the procedure of summary trials, the non obstante clause and the ex- pression \"as far as possible\" used in Section 143 coupled with the non obstante clause in Section 145 allow for the evidence of the complainant to be given on affidavit, that is, in the absence of the accused. This would have been impermissible (even in a summary trial under the Code of Criminal Procedure) in view of Sections 251 and 254 and especially Section 273 of the Code. The accused, however, is fully protected, as under sub- section (2) of Section 145 he has the absolute and unqualified right to have the complainant and any or all of his witnesses summoned for    cross-examination. \n22. Sub-section (2) of Section 143 mandates that the trial would proceed, as far as practicable, on a day-to- day basis and sub-section (3) of the section requires the Magistrate to make the endeavour to conclude the trial within six months from the date of filing of the complaint. Section 144 makes the process of service of summons simpler and cuts down the long time ordinarily consumed in service of summons in a regular civil suit or a criminal trial. \n23. Section 145 with its non obstante clause, as noted above, makes it possible for the evidence of the com- plainant to be taken in the absence of the accused. But the affidavit of the complainant (or any of his wit- nesses) may be read in evidence \"subject to all just exceptions\". In other words, anything inadmissible in evi- dence e.g irrelevant facts or hearsay matters would not be taken in as evidence, even though stated on affidavit. \n24. Section 146, making a major departure from the principles of the Evidence Act provides that the bank's slip or memo with the official mark showing that the cheque was dishonoured would by itself give rise to the presumption of dishonour of the cheque, unless and until that fact was disproved. Section 147 makes the of- fences punishable under the Act, compoundable. \n25. It is not difficult to see that Sections 143 to 147 lay down a kind of a special code for the trial of offences under Chapter XVII of the Negotiable Instruments Act and Sections 143 to 147 were inserted in the Act by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002 to do away with all the stages and processes in a regular criminal trial that normally cause inordinate delay in its conclusion and to make the trial procedure as expeditious as possible without in any way compromising on the right of the ac- cused for a fair trial. Here we must take notice of the fact that cases under Section 138 of the Act have been coming in such great multitude that even the introduction of such radical measures to make the trial proce- dure simplified and speedy has been of little help and cases of dishonoured cheques continue to pile up giving rise to an unbearable burden on the criminal court system.\n26. The Law Commission in its Report Number 213 sent to the Union Minister for Law and Justice on 24- 11-2008 advocated the setting up of Fast Track Magisterial Courts for dealing with the huge pendency of dis- honoured cheque cases. In Para 1.5 of the Report it was stated as follows:\n     \"1.5. Over 38 lakhs cheque bouncing cases are pending in various courts in the country. There are 7,66,974 cases pending in criminal courts in Delhi at the Magisterial level as on 1-6-2008. Out of this huge workload, a substantial portion is of cases under Section 138 of the Negotiable Instruments Act which alone count for 5,14,433 cases (cheque bouncing). According to Gujarat High Court sources, there are approximately two lakhs cheque bouncing cases all over the State, with the majority of them (84,000 cases) in Ahmedabad, followed by Surat, Vadodara and Rajkot. 73,000 cases were filed under Section 138 of the Negotiable Instruments Act (cheque bouncing) on a single day by a private telecom company before a Bangalore court, informed the Chief Justice of India, K.G Balakrishnan, urging the Government to appoint more Judges to deal with 1.8 crores pending cases in the country. The number of complaints which are pending in Bombay courts seriously cast shadow on the credibility of our trade, commerce and         business. Immediate steps have to be taken by all concerned to ensure restoration of the cred- ibility of trade, commerce and business.\"\n27. The situation arising from the mounting arrears is so grave that in the \"Vision Statement\" presented by the Union Minister for Law and Justice to the Chief Justice of India in course of the National Consultation for strengthening the Judiciary towards reducing pendency and delays held on 24-10-2009, cases of dishon- oured cheques were cited among one of the major bottlenecks in the criminal justice system. \n28. In Para 2 under the heading \"the Action Plan\" it was stated as follows:\n     \"2. Identification of bottlenecks: clearing the system       1. Studies have shown that cases under certain statutes and area of law are choking dockets of magisterial and spe- cialised courts, and the same need to be identified.\n      2. The bottlenecks shall be identified as follows:\n      (a) Matrimonial cases. \n      (b) Cases under Section 498-A of the Penal Code, 1860. \n      (c) Cases under Section 143 of the Negotiable Instruments Act, 1881. \n      (d) to (i)*****\n29. Once it is realised that Sections 143 to 147 were designed especially to lay down a much simplified procedure for the trial of dishonoured cheque cases with the sole object that the trial of those cases should follow a course even swifter than a summary trial and once it is seen that even the special procedure failed to effectively and expeditiously handle the vast multitude of cases coming to the court, the claim of the accused that on being summoned under Section 145(2), the complainant or any of his witnesses whose evidence is given on affidavit must be made to depose in examination-in-chief all over again plainly appears to be a demand for meaningless duplication, apparently aimed at delaying the trial. \n30. Nevertheless, the submissions made on behalf of the parties must be taken note of and properly dealt with. Mr Ranjit Kumar, learned Senior Advocate, appearing for the appellant in appeal arising from SLP (Crl.) No. 4760 of 2006 pointed out that sub-section (2) of Section 145 uses both the words, \"may\" (with ref- erence to the court) and shall (with reference to the prosecution or the accused). It was, therefore, beyond doubt that in the event an application is made by the accused, the court would be obliged to summon the person giving evidence on affidavit in terms of Section 145(1) without having any discretion in the matter. There can be no disagreement with this part of the submission but the question is when the person who has given his evidence on affidavit appears in court, whether it is also open to the accused to insist that before cross-examining him as to the facts stated in the affidavit he must first depose in examination-in-chief and be required to verbally state what is already said in the affidavit. \n31. Mr Ranjit Kumar referred to Section 137 of the Evidence Act, that defines \"examination-in-chief, \"cross-examination\" and \"re-examination\" and on that basis sought to argue that the word \"examine\" oc- curring in Section 145(2) must be construed to mean all the three kinds of examination of a witness. This, ac- cording to him, coupled with the use of the word shall with reference to the application made by the ac- cused made it quite clear that a person giving his evidence on affidavit, on being summoned under Section 145(2) at the instance of the accused must begin his deposition with examination-in-chief, before he may be cross-examined by the accused. In this regard he submitted that Section 145 did not override the Evidence Act or the Negotiable Instruments Act or any other law except the Code of Criminal Procedure. He further submitted that the plain language of Section 145(2) was clear and unambiguous and was capable of only one meaning and, therefore, the provision must be understood in its literl sense and the High Court was in error in resorting to purposive interpretation of the provision. In support of the submission he relied upon the de- cisions of this Court in Dental Council of India v. Hari Prakash (2001) 8 SCC 61 and Nathi Devi v. Radha Devi Gupta. (2005) 2 SCC 271. \n32. Mr Siddharth Bhatnagar, learned counsel for the appellant in the appeal arising from SLP (Crl.) No. 1106 of 2007 also joined Mr Ranjit Kumar in the submission based on literal interpretation. He also submit- ted that ordinarily the rule of literal construction should not be departed from, particularly when the words of the statute are clear and unambiguous. He relied upon Raghunath Rai Bareja v. Punjab National Bank (2007) 2 SCC 230.\n33. We are completely unable to appreciate the submission. The plea for a literal interpretation of Section 145(2) is based on the unfounded assumption that the language of the section clearly says that the person giving his evidence on affidavit, on being summoned at the instance of the accused must start his deposition in court with examination-in-chief. We find nothing in Section 145(2) to suggest that. We may also make it clear that Section 137 of the Evidence Act does not define \"examine\" to mean and include the three kinds of examination of a witness; it simply defines examination-in-chief, cross-examination and re-examina- tion\". What Section 145(2) of the Act says is simply this. The court may, at its discretion, call a person giving his evidence on affidavit and examine him as to the facts contained therein. But if an application is made ei- ther by the prosecution or by the accused the court must call the person giving his evidence on affidavit, again to be examined as to the facts contained therein. What would be the extent and nature of examination in each case is a different matter and that has to be reasonably construed in the light of the provision of Section 145(1) and having regard to the object and purpose of the entire scheme of Sections 143 to 146. The scheme of Sections 143 to 146 does not in any way affect the Judge's powers under Section 165 of the Evidence Act. \n34. As a matter of fact, Section 145(2) expressly provides that the court may, if it thinks fit, summon and ex- amine any person giving evidence on affidavit. But how would the person giving evidence on affidavit be ex- amined, on being summoned to appear before the court on the application made by the prosecution or the accused? The affidavit of the person so summoned that is already on the record is obviously in the nature of examination-in-chief. Hence, on being summoned on the application made by the accused the deponent of the affidavit (the complainant or any of his witnesses) can only be subjected to cross-examination as to the facts stated in the affidavit. \n35. Insofar as the prosecution is concerned, the occasion to summon any of its witnesses who has given his evidence on affidavit may arise in two ways. The prosecution may summon a person who has given his evi- dence on affidavit and has been cross-examined for \"re-examination\". The prosecution may also have to summon a witness whose evidence is given on affidavit in case objection is raised by the defence regarding the validity and/or sufficiency of the proof of some document(s) submitted along with the affidavit. In that event the witness may be summoned to appear before the court to cure the defect and to have the document(s) properly proved by following the correct legal mode. This appears to us as the simple answer to the above question and the correct legal position. Any other meaning given to sub-section (2) of Section 145, as suggested by Mr Ranjit Kumar would make the provision of Section 145(1) nugatory and would com- pletely defeat the very scheme of trial as designed under Sections 143 to 147.\n36. Mr Ranjit Kumar next submitted that Section 145(2) was identical to Section 296(2) of the Code of Criminal Procedure and this Court, in its decision in State Of Punjab v. Naib Din. (2001) 8 SCC 578 dealing with Section 296(2) of the Code made the following observation:\n     \"8. ... If any party to a lis wishes to examine the deponent of the affidavit it is open to him to make an application before the court that he requires the deponent to be examined or cross-examined in court. This is provided in sub- section (2) of Section 296 of the Code. When any such application is made it is the duty of the court to call such person to the court for the purpose of being examined.\" \n37. Mr Siddharth Bhatnagar representing the appellant in the appeal arising from SLP (Crl.) No. 1106 of 2007 also joined Mr Ranjit Kumar in the submission based on Section 296(2) of the Code. Mr Bhatnagar submitted that since Section 145(2) is identical to Section 296(2) of the Code, it should be interpreted in the light of the legislative history of Section 296(2) and he tried to take us into the details of the legislative his- tory of Section 296 of the Code. \n38. In our view the submission is wholly without merit. Neither Section 296(2) of the Code nor the decision in Naib Din (2001) 8 SCC 578 has any relevance or application to the trial concerning a dishonoured cheque under Sections 143 to 146 of the Act. The decision in Naib Din (2001) 8 SCC 578 was rendered in a totally different context and the issue before the Court was not, whether on being summoned on the application made by the accused, the person giving evidence on affidavit must begin his deposition with examination-in- chief. The appellants are reading into the passage from the decision in Naib Din (2001) 8 SCC 578 something that was not said by the Court. \n39. Moreover, the crucial difference between Section 296(2) of the Code and Section 145(2) of the Act is that the former deals with the evidence of a formal nature whereas under the latter provision, all evidences includ- ing substantive evidence may be given on affidavit. Section 296 is part of the elaborate procedure of a regular trial under the Code while the whole object of Section 145(2) of the Act is to design a much simpler and swifter trial procedure departing from the elaborate and time-consuming trial procedure of the Code. Hence, notwithstanding the apparent verbal similarity between Section 145(2) of the Act and Section 296(2) of the Code, it would be completely wrong to interpret the true scope and meaning of the one in the light of the other. Neither the legislative history of Section 296(2) nor any decision on that section can persuade us to hold that under Section 145(2) of the Act, on being summoned at the instance of the accused the com- plainant or any of his witnesses should be first made to depose in examination-in-chief before cross- examination. \n40. Mr Ranjit Kumar next submitted that in giving evidence on affidavit, the deponent (the complainant or any of his witnesses) can introduce hearsay or irrelevant facts in evidence to which the accused could have objected if the deposition was made in court as examination-in-chief. Hence, the accused must have the right to call the complainant (or his witness giving evidence on affidavit) into the witness box for examination-in- chief so as to get the inadmissible parts in the affidavit excluded from his evidence. Once again the submis- sion is devoid of merit. It is noted above that the evidence given on affidavit by the complainant is subject to all just exceptions\". This simply means that the evidence given on affidavit must be admissible and it must not include inadmissible materials such as facts not relevant to the issue or any hearsay statements. In case the complainant's affidavits contain statements that are not admissible in evidence, it is always open to the accused to point those out to the court and the court would then surely deal with the objections in accor- dance with law. \n41. Mr Ranjit Kumar lastly submitted that when the complainant gives his evidence on affidavit, then the documents produced along with the affidavit(s) are not proved automatically and unless the accused admits those documents under Section 294 of the Code of Criminal Procedure, the documents must be proved by oral testimony. We find no substance in this submission either and we see no reason why the affidavits should not also contain the formal proof of the enclosed documents. In case, however, the accused raises any objections with regard to the validity or sufficiency of the proof of the documents submitted along with the affidavit and if the objections are sustained by the court, it is always open to the prosecution to have the wit- ness concerned summoned and get the lacuna in the proof of the documents corrected. \n42. Mr Ranjit Kumar also made a feeble attempt to contend that the provisions of Sections 143 to 147 in- serted in the Act with effect from 6-2-2003 would operate prospectively and would not apply to cases that were pending on that date. The High Court has considered the issue in great detail and has rightly taken the view that the provisions of Sections 143 to 147 do not take away any substantive rights of the accused. Those provisions are not substantive but procedural in nature and would, therefore, undoubtedly, apply to the provisions are not substantive but procedural in nature and would, therefore, undoubtedly, apply to the cases that were pending on the date the provisions came into force. We are fully in agreement and in order to buttress the view taken by the High Court we will only refer to a decision of this Court. \n43. In Gurbachan Singh v. Satpal Singh (1990) 1 SCC 445 the Court was called upon to consider whether Section 113-A of the Evidence Act that created a presumption as to abetment of a suicide by a married woman would operate retrospectively or prospectively. The Court held:\n     \"37. The provisions of the said section do not create any new offence and as such it does not create any substantial right but it is merely a matter of procedure of evidence and as such it is retrospective and will be applicable to this case. It is profitable to refer in this connection to Halsbury's Laws of England, 4th Edn., Vol. 44, p. 570 wherein it has been stated that:\n     '922. Presumption against retrospection. The general rule is that all statutes, other than those which are merely declaratory, or which relate only to matters of procedure or of evidence, are prima facie prospective, and retrospec- tive effect is not to be given to them unless, by express words or necessary implication, it appears that this was the intention of the legislature.'\n     38. It has also been stated in the said volume of Halsbury's Laws of England at p. 574 that:\n     '925. Statutes relating to procedure or evidence. The presumption against retrospection does not apply to legisla- tion concerned merely with matters of procedure or of evidence; on the contrary, provisions of that nature are to be construed as retrospective unless there is a clear indication that such was not the intention of Parliament.' \" \n     (emphasis added)\n44. Coming now to the last question with regard to the right of the accused to give his evidence, like the com- plainant, on affidavit, the High Court has held that subject to the provisions of Sections 315 and 316 of the Code of Criminal Procedure the accused can also give his evidence on affidavit. The High Court was fully conscious that Section 145(1) does not provide for the accused to give his evidence, like the complainant, on affidavit. But the High Court argued that there was no express bar in law against the accused giving his evi- dence on affidavit and more importantly providing a similar right to the accused would be in furtherance of the legislative intent to make the trial process swifter. \n45. In para 29 of the judgment, the High Court observed as follows:\n     \"It is true that Section 145(1) confers a right on the complainant to give evidence on affidavit. It does not speak of similar right being conferred on the accused. The legislature in their wisdom may not have thought it proper to in- corporate the word 'accused' with the word 'complainant' in sub-section (1) of Section 145 in view of the immunity conferred on the accused from being compelled to be a witness against himself under Article 20(3) of the Constitution of India....\" \nThen in para 31 of the judgment it observed:\n     \"... Merely because, Section 145(1) does not expressly permit the accused to do so, does not mean that the Magistrate cannot allow the accused to give his evidence on affidavit by applying the same analogy unless there is just and reasonable ground to refuse such permission. There is no express bar on the accused to give evidence on affidavit either in the Act or in the Code.... I find no justified reason to refuse permission to the accused to give his evidence on affidavit subiect to the provisions contained in Sections 315 and 316 of the Code \"\n46. On this issue, we are afraid that the High Court overreached itself and took a course that amounts to tak- ing over the legislative functions. On a bare reading of Section 143 (sic Section 145) it is clear that the legisla- ture provided for the complainant to give his evidence on affidavit and did not provide for the accused to similarly do so. But the High Court thought that not mentioning the accused along with the complainant in sub-section (1) of Section 145 was merely an omission by the legislature that it could fill up without diffi- culty. Even though the legislature in their wisdom did not deem it proper to incorporate the word \"accused with the word \"complainant\" in Section 145(1), it did not mean that the Magistrate could not allow the ac- cused to give his evidence on affidavit by applying the same analogy unless there was a just and reasonable ground to refuse such permission. \n47. There are two errors apparent in the reasoning of the High Court. First, if the legislature in their wisdom did not think \"it proper to incorporate a word 'accused' with the word 'complainant' in Section 145(1)........, it was not open to the High Court to fill up the self-perceived blank. Secondly, the High Court was in error in drawing an analogy between the evidences of the complainant and the accused in a case of dishonoured cheque. The case of the complainant in a complaint under Section 138 of the Act would be based largely on documentary evidence. \n48. The accused, on the other hand, in a large number of cases, may not lead any evidence at all and let the prosecution stand or fall on its own evidence. In case the defence does lead any evidence, the nature of its evi- dence may not be necessarily documentary; in all likelihood the defence would lead other kinds of evidences to rebut the presumption that the issuance of the cheque was not in the discharge of any debt or liability. This is the basic difference between the nature of the complainant's evidence and the evidence of the accused in a case of dishonoured cheque. It is, therefore, wrong to equate the defence evidence with the complainant's evidence and to extend the same option to the accused as well. \n49. Coming back to the first error in the High Court's reasoning, in the guise of interpretation it is not permissible for the Court to make additions in the law and to read into it something that is just not there. In Union of India v. Deoki Nandan Aggarwal 1992 Supp (1) SCC 323, (1992) 19 ATC 219 this Court sounded the note of caution against the court usurping the role of legislator in the guise of interpretation. The Court observed:\n     \"14.... It is not the duty of the court either to enlarge the scope of the legislation or the intention of the legislature when the language of the provision is plain and unambiguous. The court cannot rewrite, recast or reframe the legis- lation for the very good reason that it has no power to legislate. The power to legislate has not been conferred on the courts. The court cannot add words to a statute or read words into it which are not there. Assuming there is a defect or an omission in the words used by the legislature the court could not go to its aid to correct or make up the deficiency. Courts shall decide what the law is and not what it should be. The court of course adopts a construction which will carry out the obvious intention of the legislature but could not legislate itself. But to invoke judicial ac- tivism to set at naught the legislative judgment is subversive of the constitutional harmony and comity of instrumentalities.\" \n50. In Raghunath Rai Bareja v. Punjab National Bank (2007) 2 SCC 230 while observing that it is the task of the elected representatives of the people to legislate and not that of the Judge even if it results in hardship or inconvenience, the Supreme Court quoted in affirmation, the observation of Justice Frankfurter of the US Supreme Court which is as follows:\n     \"41. As stated by Justice Frankfurter of the US Supreme Court (see 'Of Law and Men: Papers and Addresses of Felix Frankfurter'):\n     'Even within their area of choice the courts are not at large. They are confined by the nature and scope of the judi- cial function in its particular exercise in the field of interpretation. They are under the constraints imposed by the judicial function in our democratic society. As a matter of verbal recognition certainly, no one will gainsay that the function in construing a statute is to ascertain the meaning of words used by the legislature. To go beyond it is to usurp a power which our democracy has lodged in its elected legislature. The great Judges have constantly admon- ished their brethren of the need for discipline in observing the limitations. A Judge must not rewrite a statute, nei- ther to enlarge nor to contract it. Whatever temptations the statesmanship of policy-making might wisely suggest, construction must eschew interpolation and evisceration. He must not read in by way of creation. He must not read out except to avoid patent nonsense or internal contradiction.\" \"\n51. In Duport Steels Ltd. v. Sirs (1980) 1 WLR 142, (1980) 1 All ER 529 (HL) Lord Scarman expounded the legal position in the following words: (WLR p. 168 G-H: All ER p. 534)\n     \"But in the field of statute law the Judge must be obedient to the will of Parliament as expressed in its enactments. In this field Parliament makes, and unmakes, the law: the Judge's duty is to interpret and to apply the law, not to change it to meet the Judge's idea of what justice requires. Interpretation does, of course, imply in the interpreter a power of choice where differing constructions are possible. But our law requires the Judge to choose the construc- tion which in his judgment best meets the legislative purpose of the enactment. If the result be unjust but inevitable, the Judge may say so and invite Parliament to reconsider its provision. But he must not deny the statute.\" \n52. In the light of the above we have no hesitation in holding that the High Court was in error in taking the view, that on a request made by the accused the Magistrate may allow him to tender his evidence on affidavit and consequently, we set aside the direction as contained in sub-para (r) of para 45 of the High Court judg- ment. The appeal arising from SLP (Crl.) No. 3915 of 2006 is allowed. \n53. All the remaining six appeals are dismissed. \n54. There shall be no order as to costs. \n",
        "preamble_end_char_offset": null
    },
    "annotations": [
        {
            "start": 0,
            "end": 53,
            "text": "Mandvi Cooperative Bank Limited V. Nimesh B. Thakore.",
            "labels": [
                "PREAMBLE"
            ],
            "id": "e1b5aa9fb1a048e19b2d6f2a8e79fd8c_0"
        },
        {
            "start": 54,
            "end": 85,
            "text": "\nAftab Alam, J.- Leave granted.",
            "labels": [
                "NONE"
            ],
            "id": "cace7427e6c9461c869a6a9fefc57f6c_1"
        },
        {
            "start": 86,
            "end": 428,
            "text": "In these appeals we are required to consider the special provisions laid down by Section 145 of the Negotiable Instruments Act, 1881 (\"the Act\", hereinafter) for a dishonoured cheque trial and to consider how far certain assertions made by the accused are in accordance with the provi- sions contained in the two sub-sections of that section.",
            "labels": [
                "FAC"
            ],
            "id": "644dc27c195e4143b2881c0a02dbf4d0_2"
        },
        {
            "start": 429,
            "end": 564,
            "text": "\n2. The High Court had before it a large number of writ petitions and applications under Section 482 of the Code of Criminal Procedure.",
            "labels": [
                "FAC"
            ],
            "id": "2dbbc9a6f8be49bfb61e59569e0b8424_3"
        },
        {
            "start": 565,
            "end": 681,
            "text": "Most of those petitions were filed on behalf of the accused but a few were also at the instance of the complainants.",
            "labels": [
                "FAC"
            ],
            "id": "61c95b00832c497cb476669dc9446cd5_4"
        },
        {
            "start": 682,
            "end": 1327,
            "text": "On the basis of the grievances made and reliefs prayed for in those peti- tions the High Court framed the following two questions as arising for its consideration:\n    \"(A) Whether sub-section (2) of Section 145 of the Negotiable Instruments Act, 1881 (for short 'the Act') confers an unfettered right on the complainant and the accused to apply to the court seeking direction to give oral exami- nation-in-chief of a person giving evidence on affidavit, even in respect of the facts stated therein and that if such a right is exercised, whether the court is obliged to examine such a person in spite of the mandate of Section 145(1) of the Act?",
            "labels": [
                "ISSUE"
            ],
            "id": "2b990fa5d16f4546bc8b1f750379d8f4_5"
        },
        {
            "start": 1328,
            "end": 1640,
            "text": "\n     (B) Whether the provisions of Section 145 of the Act, as amended by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002 (for short 'the amending Act of 2002') are applicable to the complaints under Section 138 of the Act pending on the date on which the amendment came into force?",
            "labels": [
                "ISSUE"
            ],
            "id": "e874536eaf28459fa4089dc0621176d7_6"
        },
        {
            "start": 1641,
            "end": 1745,
            "text": "In other words, do the amended provisions of Sections 145(1) and (2) of the Act operate retrospectively?",
            "labels": [
                "ISSUE"
            ],
            "id": "e7a96e72c69a46ef9d10be5dad046858_7"
        },
        {
            "start": 1746,
            "end": 2118,
            "text": "\n3. Answering the questions after a detailed and careful consideration of all the relevant provisions and earlier decisions of courts, the High Court held that the person (the complainant or his witness) giving evidence on affidavit may be summoned by the court for putting questions as envisaged under Section 165 of the Evidence Act, 1872 (vide para 24 of the judgment).",
            "labels": [
                "ANALYSIS"
            ],
            "id": "811bce6796bf41fa843cb23be9f3f836_8"
        },
        {
            "start": 2119,
            "end": 2259,
            "text": "He would also be summoned on an application made by the accused but the right of the accused is limited to cross-examination of the witness.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "1544ceae3dee4f3f9d044edf156e376d_9"
        },
        {
            "start": 2260,
            "end": 2592,
            "text": "In terms of Section 145(2) the accused can undoubtedly cross-examine a person whose evidence is given on affidavit but the ac- cused cannot insist that the witness, on coming to court, should first depose in examination-in-chief even in respect of matters which are already stated by him on affidavit (vide para 25 of the judgment).",
            "labels": [
                "ANALYSIS"
            ],
            "id": "00a6fa4ead8945fb9fec9a52497907d7_10"
        },
        {
            "start": 2593,
            "end": 2764,
            "text": "\n4. The High Court further explained that for the prosecution the occasion to summon any of its witnesses who have given their evidence on affidavit may arise in two ways.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "ef98ef3e83cc46c4b00aab9a7f4cd2ea_11"
        },
        {
            "start": 2765,
            "end": 2888,
            "text": "The prosecution may summon a person who has given his evidence on affidavit and has been cross-examined for re-examination.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "e36bf80454114c84ae99f07bb5edcfbb_12"
        },
        {
            "start": 2889,
            "end": 2974,
            "text": "This right of the prosecution, the High Court observed, was not in dispute before it.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "f927d2d80331462e8a490e6ad55f1b72_13"
        },
        {
            "start": 2975,
            "end": 3219,
            "text": "The prosecution may also have to sum- mon a witness whose evidence is given on affidavit in case objection is raised by the defence regarding the va- lidity and/or sufficiency of the proof of some document(s) submitted along with the affidavit.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "9df0cc3508ff4d2abbe26922470db083_14"
        },
        {
            "start": 3220,
            "end": 3422,
            "text": "In that event the witness may be summoned to appear before the court to cure the defect and to have the document(s) properly proved by following the correct legal mode (vide para 26 of the judgment).\n5.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "6b7d31d8e64b4fe9838973373f9c1b99_15"
        },
        {
            "start": 3423,
            "end": 3573,
            "text": "The High Court then considered the claim of the accused that any evidence in defence, like the complainant's evidence, may also be given on affidavit.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "9c29b2cb76fb4f3797edc1b1bcef3074_16"
        },
        {
            "start": 3574,
            "end": 3896,
            "text": "It upheld the claim observing as follows:\n     \"... Merely because, Section 145(1) does not expressly permit the accused to do so, does not mean that the Magistrate cannot allow the accused to give his evidence on affidavit by applying the same analogy unless there is just and reasonable ground to refuse such permission.",
            "labels": [
                "STA"
            ],
            "id": "b395617cb0974c1eb518bb7e6697a147_17"
        },
        {
            "start": 3897,
            "end": 4006,
            "text": "There is no express bar on the accused to give evidence on affidavit either in the Act or in the Code........",
            "labels": [
                "ANALYSIS"
            ],
            "id": "31c83f867cfa407c85978b0067adcaf2_18"
        },
        {
            "start": 4007,
            "end": 4177,
            "text": "I find no justified reason to refuse permission to the accused to give his evidence on affidavit subject to the provisions contained in Sections 315 and 316 of the Code.\"",
            "labels": [
                "ANALYSIS"
            ],
            "id": "506937a860a44d9aaf6fcefd0f224f86_19"
        },
        {
            "start": 4178,
            "end": 4476,
            "text": "\n6. Coming then to Question B, the High Court had no difficulty in holding that the provisions of sub-sec- tions (1) and (2) of Section 145 were not substantive but only procedural in nature and, therefore, those provisions would be applicable to the cases pending on the date they came into force.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "c7b4a7fb58e14a8e9d56bd3bb6bd3143_20"
        },
        {
            "start": 4477,
            "end": 4834,
            "text": "Apart from considering the two questions the High Court also laid down, on the request of the parties, a number of guidelines [vide sub-paras (a) to (r) of para 45 of the judgment] in regard to the procedure that the trial court, the com- plainant and the accused should follow in a dishonoured cheque trial on a complaint made under Section 138 of the Act.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "ff23c063b58d43b6aa3169a43453ac47_21"
        },
        {
            "start": 4835,
            "end": 4932,
            "text": "We may have to refer to some of those guidelines later, at an appropriate place in this judgment.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "dbb05b6454a8435e9f3eed2bdb77a120_22"
        },
        {
            "start": 4933,
            "end": 5082,
            "text": "\n7. The High Court judgment has given rise to these seven appeals, in which the following three issues arise for consideration by this Court:\n     1.",
            "labels": [
                "ISSUE"
            ],
            "id": "13686ef3cee34264bf5a6aaba23bef33_23"
        },
        {
            "start": 5083,
            "end": 5508,
            "text": "The extent of the right of the accused under Section 145(2) of the Act: whether the right of the accused is limited to cross-examination of any person giving evidence on affidavit or is it open to the accused to insist that notwith- standing the evidence earlier given on affidavit, on coming to the court the complainant or his witness should first give deposition in examination-in-chief before being cross-examined by him?",
            "labels": [
                "STA"
            ],
            "id": "e9a1ed974b4143ebad3be128cfe8c95d_24"
        },
        {
            "start": 5509,
            "end": 5713,
            "text": "[Appeals arising from SLP (Crl.) No. 4760 of 2006, SLP (Crl.) No. 5689 of 2006, SLP (Crl.) No. 1106 of 2007, SLP (Crl.) No. 6442 of 2007, SLP (Crl.) No. 6443 of 2007, SLP (Crl.) No. 6703 of 2007.]\n     2.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "9aa4fcfffd234f1c81b6397b3b55eb0f_25"
        },
        {
            "start": 5714,
            "end": 5909,
            "text": "Whether the provisions of sub-sections (1) and (2) of Section 145 of the Act would apply to proceedings that were pending on 6-2-2003, the date on which those provisions were inserted in the Act?",
            "labels": [
                "ANALYSIS"
            ],
            "id": "0a16db2a93484e60a181f115bca67c3d_26"
        },
        {
            "start": 5910,
            "end": 5968,
            "text": "[Appeal arising from SLP (Crl.) No. 4760 of 2006.]\n     3.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "020b293fc17b41e79557d874e94a9d0c_27"
        },
        {
            "start": 5969,
            "end": 6113,
            "text": "Whether the right to give evidence on affidavit as provided to the complainant under Section 145(1) of the Act is also available to the accused?",
            "labels": [
                "ANALYSIS"
            ],
            "id": "04a5181edd144948bc35190c810283b4_28"
        },
        {
            "start": 6114,
            "end": 6167,
            "text": "[Appeal arising from SLP (Crl.) No. 3915 of 2006.]\n8.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "86c9b52bcd184e49a54fd1a0758afb6f_29"
        },
        {
            "start": 6168,
            "end": 6428,
            "text": "For a proper appreciation of the issues it would be necessary to examine the relevant legal provisions and to ascertain the objects and reasons for which those provisions were brought into existence by making amendments in the Negotiable Instruments Act, 1881.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "38b5889a5f4e4315a7a126fa673312c8_30"
        },
        {
            "start": 6429,
            "end": 6677,
            "text": "The Negotiable Instruments Act was amended first by the Banking, Public Financial Institutions and Negotiable Instruments Laws (Amendment) Act, 1988 and a second time by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "dc2bf86e06a648c5a51804882eab8c8c_31"
        },
        {
            "start": 6679,
            "end": 6767,
            "text": "9. The first amendment inserted Chapter XVII in the Act, comprising Sections 138 to 142.",
            "labels": [
                "STA"
            ],
            "id": "2ad46e84850144e3a04526918cba1526_32"
        },
        {
            "start": 6768,
            "end": 7432,
            "text": "Section 138 made, for the first time in the legislative history of the country, the issuance of a cheque by any person in discharge of any debt or liability owed by him to its holder, that was not honoured by the banker because of insuffi- ciency of funds in the account, a penal offence for the drawer that would make him liable to punishment with imprisonment that might extend to one year (now, two years after the second amendment with effect from 6- 2-2003) or with fine that might extend to twice the amount of the cheque or both; the four clauses of the pro- viso then laid down the preconditions to attract the section, as safeguards for the honest drawer.",
            "labels": [
                "STA"
            ],
            "id": "4310de24c87c449892e7621db5b23229_33"
        },
        {
            "start": 7433,
            "end": 7591,
            "text": "\n10. Section 139 created a presumption (rebuttable!) that the cheque was issued by the drawer in discharge of any debt or liability owed by him to its holder.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "572fd7ccd9db416aa12b66da6bdaf240_34"
        },
        {
            "start": 7592,
            "end": 7858,
            "text": "Section 140 provided that it would not be open to the accused in a prosecution under Section 138 to take the plea that when he issued the cheque he had no reason to be- lieve that on presentation, the cheque may be dishonoured for the reasons stated in that section.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "8d32da1f081d44cb90c67ecf9f348b08_35"
        },
        {
            "start": 7859,
            "end": 7904,
            "text": "Section 141 dealt with offences by companies.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "5c9ed28b418141d297af7b85046e19d2_36"
        },
        {
            "start": 7905,
            "end": 8052,
            "text": "Section 142 laid down the conditions subject to which alone the court would take cognizance of any offence punishable under Section 138 of the Act.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "0f063cb1528f4d92935d00579f7beb8f_37"
        },
        {
            "start": 8054,
            "end": 8290,
            "text": "11. The Statement of Objects and Reasons appended to the Bill explaining the provisions of the new Chapter stated as follows:\n     \"This clause [Clause (4) of the Bill] inserts a new Chapter XVII in the Negotiable Instruments Act, 1881.",
            "labels": [
                "STA"
            ],
            "id": "1e1958bc378b49aaa7dbbcb4e1afbe8c_38"
        },
        {
            "start": 8291,
            "end": 8770,
            "text": "The provi- sions contained in the new Chapter provide that where any cheque drawn by a person for the discharge of any lia- bility is returned by the bank unpaid for the reason of the insufficiency of the amount of money standing to the credit of the account on which the cheque was drawn or for the reason that it exceeds the arrangements made by the drawer of the cheque with the bankers for that account, the drawer of such cheque shall be deemed to have committed an offence.",
            "labels": [
                "STA"
            ],
            "id": "cd72e9f901fb422899f8f9653649d0bb_39"
        },
        {
            "start": 8771,
            "end": 9127,
            "text": "In that case, the drawer, without prejudice to the other provisions of the said Act, shall be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to twice the  punishable with imprisonment for a term which may extend to one year, or with fine which may extend to twice the amount of the cheque, or with both.",
            "labels": [
                "STA"
            ],
            "id": "2f04ab7747594e08a2d37eb006d33b53_40"
        },
        {
            "start": 9128,
            "end": 9907,
            "text": "\n     The provisions have also been made that to constitute the said offence:\n     (a) such cheque should have been presented to the bank within a period of six months of the date of its drawal or within the period of its validity, whichever is earlier; and      (b) the payee or holder in due course of such cheque should have made a demand for the payment of the said amount of money by giving a notice, in writing, to the drawer of the cheque within fifteen days of the receipt of the information by him from the bank regarding the return of the cheque unpaid; and      (c) the drawer of such cheque should have failed to make the payment of the said amount of money to the payee or the holder in due course of the cheque within fifteen days of the receipt of the said notice.",
            "labels": [
                "STA"
            ],
            "id": "370e68a433ac4a59bfc4a88e780f2fd3_41"
        },
        {
            "start": 9908,
            "end": 10078,
            "text": "\nIt has also been provided that it shall be presumed, unless the contrary is proved, that the holder of such cheque re- ceived the cheque in the discharge of a liability.",
            "labels": [
                "STA"
            ],
            "id": "2620dde77cf3445fb7db1c7556fd1968_42"
        },
        {
            "start": 10079,
            "end": 10213,
            "text": "Defences which may or may not be allowed in any prosecution for such offence have also been provided to make the provisions effective.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "b5c2ef545fec43d6be041b1b48f32295_43"
        },
        {
            "start": 10214,
            "end": 10313,
            "text": "Usual provision relating to offences by com- panies has also been included in the said new Chapter.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "59e2a047055743589b4ab3494398dbbd_44"
        },
        {
            "start": 10314,
            "end": 10488,
            "text": "In order to ensure that genuine and honest bank customers are not harassed or put to inconvenience, sufficient safeguards have also been provided in the proposed new Chapter.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "c9f0aebb927440e0912a5887759ad98d_45"
        },
        {
            "start": 10489,
            "end": 10944,
            "text": "Such safeguards are:\n     (a) that no court shall take cognizance of such offence except on a complaint, in writing, made by the payee or the holder in due course of the cheque;\n     (b) that such complaint is made within one month of the date on which the cause of action arises; and      (c) that no court inferior to that of a Metropolitan Magistrate or a Judicial Magistrate or a Judicial Magistrate of the First Class shall try any such offence.\"\n12.",
            "labels": [
                "STA"
            ],
            "id": "87b7decb6a5d474ab0efb4c2088c1bad_46"
        },
        {
            "start": 10945,
            "end": 11209,
            "text": "The speech of the Minister of Finance on 2-12-1988 in course of the debate on the Bill in the Lok Sabha tells us that Chapter XVII was inserted in the Act, in light of the report submitted in the year 1975 by the Committee on Banking Laws headed by Dr. Rajamannar.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "b24e0904db394dd08bf6610715d309f1_47"
        },
        {
            "start": 11210,
            "end": 11556,
            "text": "It appears that in the course of the debate some Members had expressed the view that the provisions of Chapter XVII sought to be inserted in the Act, con- tained very abnormal, rather very dangerous provisions, in that a kind of civil liability is supposed to be con- verted into a kind of criminal act which would have far-reaching consequences.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "ea5502d47dd24c3c89355c2d6cdd4268_48"
        },
        {
            "start": 11558,
            "end": 11780,
            "text": "13. Dispelling the apprehensions of those Members the Minister pointed out that the proposed amendments were along the same lines as the law prevailing in other countries such as UK, USA, Belgium, Portugal, Argentina, etc.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "c67ec9eeb9424587bc6d74c2210a3305_49"
        },
        {
            "start": 11781,
            "end": 11990,
            "text": "Further, in regard to the object of the provisions, the Minister stated as follows:\n     \"In fact, the whole purpose of bringing about this provision is to make the drawing of cheque a regular mode of payment.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "c238b7377a314029a650eb2409035707_50"
        },
        {
            "start": 11991,
            "end": 12233,
            "text": "Unfortunately, today if a cheque is given to a party, they will not consider it a sufficient means of pay- ment, they will insist that unless the cheque is encashed, they will not take that as a kind of payment made.\"\n    (emphasis added)\n14.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "f12f8c45585c40a8aea84f55d3cd889f_51"
        },
        {
            "start": 12234,
            "end": 12756,
            "text": "The Minister then elaborated on the safeguards provided in the law to save an honest drawer from com- ing under the rigours of the section due to any bona fide mistake and finally went on to say as follows:\n     \"But in spite of time for payment and all other provisions that are made, if the party is not able to make good the amount of money which he owes to a particular party and in spite of the notice also he does not act, the conclusion is inescapable that he will be prosecuted, legal action will have to be taken.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "5c5a42ce022d447295b8d19d9b57ce47_52"
        },
        {
            "start": 12757,
            "end": 12930,
            "text": "It is for the court to take a decision, whether he be imprisoned for one year, or double the amount that would be paid as fine or both things will have to be taken together.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "bdaac982a84d4f2abdf713d014f0c7e2_53"
        },
        {
            "start": 12931,
            "end": 12982,
            "text": "Ultimately, it is for the court to take a decision.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "9887a802d4454d279d571690d81d7aaa_54"
        },
        {
            "start": 12983,
            "end": 13247,
            "text": "But these are the provisions which have been provided for so that the parties drawing the cheques are careful enough to see that there are enough resources available in their bank account and if a cheque is drawn, it will not be returned.\"\n    (emphasis added)\n15.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "0ca2fd648c0e410baa7a772ac63b40b4_55"
        },
        {
            "start": 13248,
            "end": 13415,
            "text": "The provisions of the newly inserted Chapter XVII, on coming into force with effect from 1-4-1989, brought in a veritable deluge of cases in the criminal court system.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "2c0c1cace7fc4e30adcddc75f07570c2_56"
        },
        {
            "start": 13416,
            "end": 13668,
            "text": "In the metropolitan cities and the com- mercial centres of the country, it almost appeared that the main function of the Magistrate's court was to re- cover monies on behalf of parties on the wrong end of the commercial transactions that had gone sour.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "4ed11765acfd4dfc8ad9951fd42e9a98_57"
        },
        {
            "start": 13670,
            "end": 13930,
            "text": "16. Complaints under Section 138 of the Act came to be filed in such large numbers that it became impossible for the courts to handle them within a reasonable time and it also had a highly adverse effect on the courts' normal work in ordinary criminal matters.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "77e27caa0d9a4888bf9bbafc4d158931_58"
        },
        {
            "start": 13931,
            "end": 14130,
            "text": "A remedial measure was urgently required and the legislature took action by introducing further amendments in the Act by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "aa5329d41b8247098b4e946dfe8b83cc_59"
        },
        {
            "start": 14131,
            "end": 14306,
            "text": "The 2002 Amendment inserted in the Act for the first time Sections 143 to 147 besides bringing about a number of changes in the existing provisions of Sections 138 to 142.\n17.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "944e3c3fd09c4f6ab88ad6f5bcbeb52c_60"
        },
        {
            "start": 14307,
            "end": 14670,
            "text": "Section 143 gave to the court the power to try cases summarily; Section 144 provided for the mode of ser- vice of summons; Section 145 made it possible for the complainant to give his evidence on affidavit; Section 146 provided that the bank's slip would be prima facie evidence of certain facts and Section 147 made the of- fences under the Act compoundable.\n18.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "5433ff8ad111460699fb364ae245aecb_61"
        },
        {
            "start": 14671,
            "end": 15066,
            "text": "The Statement of Objects and Reasons appended to the Bill stated as follows:\n     \"The Negotiable Instruments Act, 1881 was amended by the Banking, Public Financial Institutions and Negotiable Instruments Laws (Amendment) Act, 1988 wherein a new Chapter XVII was incorporated for penalties in case of dishonour of cheques due to insufficiency of funds in the account of the drawer of the cheque.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "f1a3a9257f3a44bda9653ec86dfb2ff2_62"
        },
        {
            "start": 15067,
            "end": 15207,
            "text": "These provisions were incorporated with a view to encourage the culture of use of cheques and enhancing the credibility of the in- strument.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "a0775c984dd14523a5183a7f42cbb7c9_63"
        },
        {
            "start": 15208,
            "end": 15380,
            "text": "The existing provisions in the Negotiable Instruments Act, 1881, namely, Sections 138 to 142 in Chapter XVII have been found deficient in dealing with dishonour of cheques.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "ee79bcb3459a4546ab8423ee2eb7ce7d_64"
        },
        {
            "start": 15381,
            "end": 15552,
            "text": "Not only the punishment provided in the Act has proved to be inadequate, the procedure prescribed for the courts to deal with such matters has been found to be cumbersome.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "bb9b69c9a26c4d57a6be9d422b8ed777_65"
        },
        {
            "start": 15553,
            "end": 15683,
            "text": "The courts are unable to dispose of such cases expeditiously in a time-bound manner in view of the procedure contained in the Act.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "06bddd803b784a83b4c6f17d3bc0ea50_66"
        },
        {
            "start": 15685,
            "end": 15832,
            "text": "2. A large number of cases are reported to be pending under Sections 138 to 142 of the Negotiable Instruments Act in various courts in the country.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "c99e7bc5639341b6a9f1633d003bf447_67"
        },
        {
            "start": 15833,
            "end": 16129,
            "text": "Keeping in view the large number of complaints under the said Act pending in var- ious courts, a working group was constituted to review Section 138 of the Negotiable Instruments Act, 1881 and make recommendations as to what changes were needed to effectively achieve the purpose of that section.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "beb48755d3f14ce9ba3a14d942393e6f_68"
        },
        {
            "start": 16131,
            "end": 16470,
            "text": "3. The recommendations of the Working Group along with other representations from various institutions and or- ganisations were examined by the Government in consultation with Reserve Bank of India and other legal experts, and a Bill, namely, the Negotiable Instruments (Amendment) Bill, 2001 was introduced in the Lok Sabha on 24-7- 2001.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "e19c03f7ceac4b41a68382463ccb6e42_69"
        },
        {
            "start": 16471,
            "end": 16621,
            "text": "The Bill was referred to the Standing Committee on Finance which made certain recommendations in its re- port submitted to Lok Sabha in November 2001.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "2525bdc979a949f6a4a55442c129efed_70"
        },
        {
            "start": 16623,
            "end": 18667,
            "text": "4. Keeping in view the recommendations of the Standing Committee on Finance and other representations, it has been decided to bring out, inter alia, the following amendments in the Negotiable Instruments Act, 1881, namely:\n     ___      (i) to increase the punishment as prescribed under the Act from one year to two years;\n     (ii) to increase the period for issue of notice by the payee to the drawer from 15 days to 30 days;\n     (iii) to provide discretion to the court to waive the period of one month, which has been prescribed for taking cog- nizance of the case under the Act;\n     (iv) to prescribe procedure for dispensing with preliminary evidence of the complainant;\n     (v) to prescribe procedure for servicing of summons to the accused or witness by the court through speed post or empanelled private couriers;\n     (vi) to provide for summary trial of the cases under the Act with a view to speeding up disposal of cases;\n     (vii) to make the offences under the Act compoundable;\n     (viii) to exempt those Directors from prosecution under Section 141 of the Act who are nominated as Directors of a company by virtue of their holding any office or employment in the Central Government or State Government or a financial corporation owned or controlled by the Central Government, or the State Government, as the case may be;\n     (ix) to provide that the Magistrate trying an offence shall have power to pass sentence of imprisonment for a term exceeding one year and amount of fine exceeding five thousand rupees;\n     (x) to make the Information Technology Act, 2000 applicable to the Negotiable Instruments Act, 1881 in relation to electronic cheques and truncated cheques subject to such modifications and amendments as the Central Government, in consultation with the Reserve Bank of India, considers necessary for carrying out the purposes of the Act, by notification in the Official Gazette; and      (xi) to amend definitions of 'bankers' books' and 'certified copy' given in the Bankers' Books Evidence Act, 1891.\n5.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "e746cabc109842a7a3d8465ffaf9ffc1_71"
        },
        {
            "start": 18668,
            "end": 19011,
            "text": "The proposed amendments in the Act are aimed at early disposal of cases relating to dishonour of cheques, en- hancing punishment for offenders, introducing electronic image of a truncated cheque and a cheque in the elec- tronic form as well as exempting an official nominee Director from prosecution under the Negotiable Instruments Act, 1881.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "a45d0a1bf5fb41e78b57d9877b74cca4_72"
        },
        {
            "start": 19013,
            "end": 19087,
            "text": "6. The Bill seeks to achieve the above objects.\"\n     (emphasis added)\n19.",
            "labels": [
                "STA"
            ],
            "id": "4da6cb24eedf457c9c28e4d851abebcf_73"
        },
        {
            "start": 19088,
            "end": 19310,
            "text": "Though, in these appeals, we are mainly concerned with the provisions of Section 145, it would be useful here to take a look at all the five sections introduced by the 2002 Amendment:\n     \"143. Power of court to try cases",
            "labels": [
                "ANALYSIS"
            ],
            "id": "07b54b25863843629a8d0f39fef9362f_74"
        },
        {
            "start": 19311,
            "end": 19324,
            "text": "summarily.(1)",
            "labels": [
                "STA"
            ],
            "id": "a53e19c9126c4cd6a77154be4d3205b9_75"
        },
        {
            "start": 19325,
            "end": 19664,
            "text": "Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), all offences under this Chapter shall be tried by a Judicial Magistrate of the First Class or by a Metropolitan Magistrate and the provisions of Sections 262 to 265 (both inclusive) of the said Code shall, as far as may be, apply to such trials:\n     ",
            "labels": [
                "STA"
            ],
            "id": "cf455f6cd9394223abafe71e5cf5698e_76"
        },
        {
            "start": 19664,
            "end": 20218,
            "text": "Provided further that when at the commencement of, or in the course of, a summary trial under this section, it ap- pears to the Magistrate that the nature of the case is such that a sentence of imprisonment for a term exceeding one year may have to be passed or that it is, for any other reason, undesirable to try the case summarily, the Magistrate shall after hearing the parties, record an order to that effect and thereafter recall any witness who may have been examined and proceed to hear or rehear the case in the manner provided by the said Code.",
            "labels": [
                "STA"
            ],
            "id": "66dda93c679444f3bb8ea6bc8e6dae4b_77"
        },
        {
            "start": 20219,
            "end": 20526,
            "text": "\n     (2) The trial of a case under this section shall, so far as practicable, consistently with the interests of justice, be con- tinued from day to day until its conclusion, unless the court finds the adjournment of the trial beyond the following day to be necessary for reasons to be recorded in writing.",
            "labels": [
                "STA"
            ],
            "id": "7b736afbdf314af785a7c9055baf1169_78"
        },
        {
            "start": 20527,
            "end": 20728,
            "text": "\n     (3) Every trial under this section shall be conducted as expeditiously as possible and an endeavour shall be made to conclude the trial within six months from the date of filing of the complaint.",
            "labels": [
                "STA"
            ],
            "id": "8b82a4cf6314417fb6f7319f2872667e_79"
        },
        {
            "start": 20729,
            "end": 20895,
            "text": "\n     144. Mode of service of summons.(1) Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), and for the purposes of this Chapter",
            "labels": [
                "STA"
            ],
            "id": "b07f71fc5e3a428d8222337824dcc95a_80"
        },
        {
            "start": 20896,
            "end": 21193,
            "text": ", a Magistrate issuing a summons to an accused or a witness may direct a copy of summons to be served at the place where such accused or witness ordinarily resides or carries on business or personally works for gain, by speed post or by such courier services as are approved by a Court of Session.",
            "labels": [
                "STA"
            ],
            "id": "788a85275aa841138667ba014b5dea0e_81"
        },
        {
            "start": 21194,
            "end": 21564,
            "text": "\n     (2) Where an acknowledgment purporting to be signed by the accused or the witness or an endorsement purported to be made by any person authorised by the Postal Department or the courier services that the accused or the wit- ness refused to take delivery of summons has been received, the court issuing the summons may declare that the summons has been duly served.",
            "labels": [
                "STA"
            ],
            "id": "8ed64403659d4951ad2b651c7e5a3b64_82"
        },
        {
            "start": 21565,
            "end": 21877,
            "text": "\n     145. Evidence on affidavit.(1) Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), the evidence of the complainant may be given by him on affidavit and may, subject to all just exceptions be read in evidence in any enquiry, trial or other proceeding under the said Code.",
            "labels": [
                "STA"
            ],
            "id": "c2dc8089df344d6b83ee48a80322e66d_83"
        },
        {
            "start": 21878,
            "end": 22081,
            "text": "\n     (2) The court may, if it thinks fit, and shall, on the application of the prosecution or the accused, summon and ex- amine any person giving evidence on affidavit as to the facts contained therein.",
            "labels": [
                "STA"
            ],
            "id": "4afb48aaab3e4796943635d482ae2314_84"
        },
        {
            "start": 22088,
            "end": 22128,
            "text": "146. Bank's slip prima facie evidence of",
            "labels": [
                "STA"
            ],
            "id": "8c1e5b34e1e74c798a80000e069af325_85"
        },
        {
            "start": 22129,
            "end": 22415,
            "text": "certain facts.-The court shall, in respect of every proceeding under this Chapter, on production of bank's slip or memo having thereon the official mark denoting that the cheque has been dishonoured, presume the fact of dishonour of such cheque, unless and until such fact is disproved.",
            "labels": [
                "STA"
            ],
            "id": "25e67a1433f6489ba1597b9b259b56bb_86"
        },
        {
            "start": 22416,
            "end": 22607,
            "text": "\n     147. Offences to be compoundable.-Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), every offence punishable under this Act shall be compoundable.\"",
            "labels": [
                "STA"
            ],
            "id": "ac00eec4af60401f9738d85d560dc47f_87"
        },
        {
            "start": 22609,
            "end": 22819,
            "text": "20. It may be noted that the provisions of Sections 143, 144, 145 and 147 expressly depart from and override the provisions of the Code of Criminal Procedure, the main body of adjective law for criminal trials.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "15b3ca9ff936475f8ae584b34d6748b9_88"
        },
        {
            "start": 22820,
            "end": 22907,
            "text": "The provisions of Section 146 similarly depart from the principles of the Evidence Act.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "f116910b79ae4a23a4d8e9f4bbb870c8_89"
        },
        {
            "start": 22908,
            "end": 23307,
            "text": "Section 143 makes it pos- sible for the complaints under Section 138 of the Act to be tried in the summary manner, except, of course, for the relatively small number of cases where the Magistrate feels that the nature of the case is such that a sentence of imprisonment for a term exceeding one year may have to be passed or that it is, for any other rea- son, undesirable to try the case summarily.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "098782c18e41473d99348fdaa1c9a816_90"
        },
        {
            "start": 23309,
            "end": 23665,
            "text": "21. It is, however, significant that the procedure of summary trials is adopted under Section 143 subject to the qualification \"as far as possible\", thus, leaving sufficient flexibility so as not to affect the quick flow of the qualification \"as far as possible, thus, leaving sufficient flexibility so as not to affect the quick flow of the trial process.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "fb07564fcfd248d8a7dba5ce9531378e_91"
        },
        {
            "start": 23666,
            "end": 23965,
            "text": "Even while following the procedure of summary trials, the non obstante clause and the ex- pression \"as far as possible\" used in Section 143 coupled with the non obstante clause in Section 145 allow for the evidence of the complainant to be given on affidavit, that is, in the absence of the accused.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "36d4c95899f64a64b57cc0d4b97e0032_92"
        },
        {
            "start": 23966,
            "end": 24135,
            "text": "This would have been impermissible (even in a summary trial under the Code of Criminal Procedure) in view of Sections 251 and 254 and especially Section 273 of the Code.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "b494cd1cebac4d8788256a69f8fa0b80_93"
        },
        {
            "start": 24136,
            "end": 24351,
            "text": "The accused, however, is fully protected, as under sub- section (2) of Section 145 he has the absolute and unqualified right to have the complainant and any or all of his witnesses summoned for    cross-examination.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "f190d46d53714072b1b4de3bae6cf725_94"
        },
        {
            "start": 24352,
            "end": 24635,
            "text": "\n22. Sub-section (2) of Section 143 mandates that the trial would proceed, as far as practicable, on a day-to- day basis and sub-section (3) of the section requires the Magistrate to make the endeavour to conclude the trial within six months from the date of filing of the complaint.",
            "labels": [
                "STA"
            ],
            "id": "19c64fbcb8084cbb8c0045f8cc1eb6fb_95"
        },
        {
            "start": 24636,
            "end": 24810,
            "text": "Section 144 makes the process of service of summons simpler and cuts down the long time ordinarily consumed in service of summons in a regular civil suit or a criminal trial.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "636aacf3f100462989b618e8bab924b5_96"
        },
        {
            "start": 24811,
            "end": 24972,
            "text": "\n23. Section 145 with its non obstante clause, as noted above, makes it possible for the evidence of the com- plainant to be taken in the absence of the accused.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "eb11b3a40a10488ab8670f107601680b_97"
        },
        {
            "start": 24973,
            "end": 25095,
            "text": "But the affidavit of the complainant (or any of his wit- nesses) may be read in evidence \"subject to all just exceptions\".",
            "labels": [
                "ANALYSIS"
            ],
            "id": "a46b5e24409248898c787763182c13a1_98"
        },
        {
            "start": 25096,
            "end": 25255,
            "text": "In other words, anything inadmissible in evi- dence e.g irrelevant facts or hearsay matters would not be taken in as evidence, even though stated on affidavit.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "a40c6242a45d42a78c7b65c55b83d007_99"
        },
        {
            "start": 25256,
            "end": 25554,
            "text": "\n24. Section 146, making a major departure from the principles of the Evidence Act provides that the bank's slip or memo with the official mark showing that the cheque was dishonoured would by itself give rise to the presumption of dishonour of the cheque, unless and until that fact was disproved.",
            "labels": [
                "STA"
            ],
            "id": "ecc0496189e34a96894086b0f23a9e52_100"
        },
        {
            "start": 25555,
            "end": 25627,
            "text": "Section 147 makes the of- fences punishable under the Act, compoundable.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "c357189348b049d2a0d03469322b4b6d_101"
        },
        {
            "start": 25629,
            "end": 26194,
            "text": "25. It is not difficult to see that Sections 143 to 147 lay down a kind of a special code for the trial of offences under Chapter XVII of the Negotiable Instruments Act and Sections 143 to 147 were inserted in the Act by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002 to do away with all the stages and processes in a regular criminal trial that normally cause inordinate delay in its conclusion and to make the trial procedure as expeditious as possible without in any way compromising on the right of the ac- cused for a fair trial.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "315ea6ae3abd445b94096105bc099cc2_102"
        },
        {
            "start": 26195,
            "end": 26563,
            "text": "Here we must take notice of the fact that cases under Section 138 of the Act have been coming in such great multitude that even the introduction of such radical measures to make the trial proce- dure simplified and speedy has been of little help and cases of dishonoured cheques continue to pile up giving rise to an unbearable burden on the criminal court system.\n26.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "159999e7054e46008f28306b388ae8fa_103"
        },
        {
            "start": 26564,
            "end": 26793,
            "text": "The Law Commission in its Report Number 213 sent to the Union Minister for Law and Justice on 24- 11-2008 advocated the setting up of Fast Track Magisterial Courts for dealing with the huge pendency of dis- honoured cheque cases.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "bea8d2b010404a67bc4fc24cc29ae59f_104"
        },
        {
            "start": 26794,
            "end": 26856,
            "text": "In Para 1.5 of the Report it was stated as follows:\n     \"1.5.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "bc3506fbc9874f7c88d518acd5b52314_105"
        },
        {
            "start": 26857,
            "end": 26938,
            "text": "Over 38 lakhs cheque bouncing cases are pending in various courts in the country.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "36302fba4f2b4df7bf347681c49670db_106"
        },
        {
            "start": 26939,
            "end": 27040,
            "text": "There are 7,66,974 cases pending in criminal courts in Delhi at the Magisterial level as on 1-6-2008.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "ce7d3e17275a4333bf8e91d61d5ada84_107"
        },
        {
            "start": 27041,
            "end": 27209,
            "text": "Out of this huge workload, a substantial portion is of cases under Section 138 of the Negotiable Instruments Act which alone count for 5,14,433 cases (cheque bouncing).",
            "labels": [
                "ANALYSIS"
            ],
            "id": "3cc4acc3139b4b399eba5710ec47335a_108"
        },
        {
            "start": 27210,
            "end": 27421,
            "text": "According to Gujarat High Court sources, there are approximately two lakhs cheque bouncing cases all over the State, with the majority of them (84,000 cases) in Ahmedabad, followed by Surat, Vadodara and Rajkot.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "d309083767784495bed318350c10b7a0_109"
        },
        {
            "start": 27422,
            "end": 27740,
            "text": "73,000 cases were filed under Section 138 of the Negotiable Instruments Act (cheque bouncing) on a single day by a private telecom company before a Bangalore court, informed the Chief Justice of India, K.G Balakrishnan, urging the Government to appoint more Judges to deal with 1.8 crores pending cases in the country.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "25eae1b5a2674ac884cc5e7145ac2eab_110"
        },
        {
            "start": 27741,
            "end": 27886,
            "text": "The number of complaints which are pending in Bombay courts seriously cast shadow on the credibility of our trade, commerce and         business.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "a441c2d606bd41528108ee6a8a42814e_111"
        },
        {
            "start": 27887,
            "end": 28017,
            "text": "Immediate steps have to be taken by all concerned to ensure restoration of the cred- ibility of trade, commerce and business.\"\n27.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "8ebff707b7f5484ea8675c14f92ea4a6_112"
        },
        {
            "start": 28018,
            "end": 28427,
            "text": "The situation arising from the mounting arrears is so grave that in the \"Vision Statement\" presented by the Union Minister for Law and Justice to the Chief Justice of India in course of the National Consultation for strengthening the Judiciary towards reducing pendency and delays held on 24-10-2009, cases of dishon- oured cheques were cited among one of the major bottlenecks in the criminal justice system.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "7050516bd7794521afe1c924de52c052_113"
        },
        {
            "start": 28429,
            "end": 28748,
            "text": "28. In Para 2 under the heading \"the Action Plan\" it was stated as follows:\n     \"2. Identification of bottlenecks: clearing the system       1. Studies have shown that cases under certain statutes and area of law are choking dockets of magisterial and spe- cialised courts, and the same need to be identified.\n      2.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "8be730e9ca9d4614a5ee44c1451cd9ac_114"
        },
        {
            "start": 28749,
            "end": 28825,
            "text": "The bottlenecks shall be identified as follows:\n      (a) Matrimonial cases.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "009969aea0f547ffa53cb75426f70c18_115"
        },
        {
            "start": 28826,
            "end": 28887,
            "text": "\n      (b) Cases under Section 498-A of the Penal Code, 1860.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "82c82178193148a2a2aa221e9c40b037_116"
        },
        {
            "start": 28888,
            "end": 28963,
            "text": "\n      (c) Cases under Section 143 of the Negotiable Instruments Act, 1881.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "a25ce7d59f6949bbafa26a4f445efd74_117"
        },
        {
            "start": 28964,
            "end": 28990,
            "text": "\n      (d) to (i)*****\n29.",
            "labels": [
                "NONE"
            ],
            "id": "d555d64d59b641f891d0cde6618206c9_118"
        },
        {
            "start": 28991,
            "end": 29707,
            "text": "Once it is realised that Sections 143 to 147 were designed especially to lay down a much simplified procedure for the trial of dishonoured cheque cases with the sole object that the trial of those cases should follow a course even swifter than a summary trial and once it is seen that even the special procedure failed to effectively and expeditiously handle the vast multitude of cases coming to the court, the claim of the accused that on being summoned under Section 145(2), the complainant or any of his witnesses whose evidence is given on affidavit must be made to depose in examination-in-chief all over again plainly appears to be a demand for meaningless duplication, apparently aimed at delaying the trial.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "5b33db4eddf04dcbaf00468916dfd373_119"
        },
        {
            "start": 29709,
            "end": 29819,
            "text": "30. Nevertheless, the submissions made on behalf of the parties must be taken note of and properly dealt with.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "2325e7ca560b4b598638dfd7f2187b09_120"
        },
        {
            "start": 29820,
            "end": 30109,
            "text": "Mr Ranjit Kumar, learned Senior Advocate, appearing for the appellant in appeal arising from SLP (Crl.) No. 4760 of 2006 pointed out that sub-section (2) of Section 145 uses both the words, \"may\" (with ref- erence to the court) and shall (with reference to the prosecution or the accused).",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "a12f63ae1d7d456284d2e68a22c11ccf_121"
        },
        {
            "start": 30110,
            "end": 30347,
            "text": "It was, therefore, beyond doubt that in the event an application is made by the accused, the court would be obliged to summon the person giving evidence on affidavit in terms of Section 145(1) without having any discretion in the matter.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "ffec8cd0208b480fba9431e2239204c2_122"
        },
        {
            "start": 30348,
            "end": 30742,
            "text": "There can be no disagreement with this part of the submission but the question is when the person who has given his evidence on affidavit appears in court, whether it is also open to the accused to insist that before cross-examining him as to the facts stated in the affidavit he must first depose in examination-in-chief and be required to verbally state what is already said in the affidavit.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "df3b0f3dd0cd4ff8967f401281567988_123"
        },
        {
            "start": 30744,
            "end": 31048,
            "text": "31. Mr Ranjit Kumar referred to Section 137 of the Evidence Act, that defines \"examination-in-chief, \"cross-examination\" and \"re-examination\" and on that basis sought to argue that the word \"examine\" oc- curring in Section 145(2) must be construed to mean all the three kinds of examination of a witness.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "994947aaa3964bb8ab421c86e36e70d0_124"
        },
        {
            "start": 31049,
            "end": 31408,
            "text": "This, ac- cording to him, coupled with the use of the word shall with reference to the application made by the ac- cused made it quite clear that a person giving his evidence on affidavit, on being summoned under Section 145(2) at the instance of the accused must begin his deposition with examination-in-chief, before he may be cross-examined by the accused.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "3ff169739f99473298b2a952cdfb24e1_125"
        },
        {
            "start": 31409,
            "end": 31577,
            "text": "In this regard he submitted that Section 145 did not override the Evidence Act or the Negotiable Instruments Act or any other law except the Code of Criminal Procedure.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "370df8c549344fbab29d4ec6289fb86d_126"
        },
        {
            "start": 31578,
            "end": 31862,
            "text": "He further submitted that the plain language of Section 145(2) was clear and unambiguous and was capable of only one meaning and, therefore, the provision must be understood in its literl sense and the High Court was in error in resorting to purposive interpretation of the provision.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "b2446107a0c6445eb4a60c68dc8a3b25_127"
        },
        {
            "start": 31863,
            "end": 32031,
            "text": "In support of the submission he relied upon the de- cisions of this Court in Dental Council of India v. Hari Prakash (2001) 8 SCC 61 and Nathi Devi v. Radha Devi Gupta.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "1a91f95fdeec4daca8d7b5e5d79d7403_128"
        },
        {
            "start": 32032,
            "end": 32049,
            "text": "(2005) 2 SCC 271.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "efdda8b731424544af6db995cca3a6b1_129"
        },
        {
            "start": 32051,
            "end": 32246,
            "text": "32. Mr Siddharth Bhatnagar, learned counsel for the appellant in the appeal arising from SLP (Crl.) No. 1106 of 2007 also joined Mr Ranjit Kumar in the submission based on literal interpretation.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "9de25a727fd24ca089fa138bbec50abb_130"
        },
        {
            "start": 32247,
            "end": 32414,
            "text": "He also submit- ted that ordinarily the rule of literal construction should not be departed from, particularly when the words of the statute are clear and unambiguous.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "435c772b13f346b689aac7c4892e8313_131"
        },
        {
            "start": 32415,
            "end": 32496,
            "text": "He relied upon Raghunath Rai Bareja v. Punjab National Bank (2007) 2 SCC 230.\n33.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "7407ecf165b94055aeef3f0b36c13f9e_132"
        },
        {
            "start": 32497,
            "end": 32551,
            "text": "We are completely unable to appreciate the submission.",
            "labels": [
                "ARG_RESPONDENT"
            ],
            "id": "011fd79999ab49b2a53e04046800892f_133"
        },
        {
            "start": 32552,
            "end": 32851,
            "text": "The plea for a literal interpretation of Section 145(2) is based on the unfounded assumption that the language of the section clearly says that the person giving his evidence on affidavit, on being summoned at the instance of the accused must start his deposition in court with examination-in-chief.",
            "labels": [
                "ARG_RESPONDENT"
            ],
            "id": "d9ccd9570bb84812a1c002d98a184b68_134"
        },
        {
            "start": 32852,
            "end": 32902,
            "text": "We find nothing in Section 145(2) to suggest that.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "c3998ad0f04e4004b7e038da87cb6990_135"
        },
        {
            "start": 32903,
            "end": 33137,
            "text": "We may also make it clear that Section 137 of the Evidence Act does not define \"examine\" to mean and include the three kinds of examination of a witness; it simply defines examination-in-chief, cross-examination and re-examina- tion\".",
            "labels": [
                "STA"
            ],
            "id": "c11e9351ded74504b163495a62788b5f_136"
        },
        {
            "start": 33138,
            "end": 33189,
            "text": "What Section 145(2) of the Act says is simply this.",
            "labels": [
                "STA"
            ],
            "id": "5d2c6446dba349749e22498ba79e344a_137"
        },
        {
            "start": 33190,
            "end": 33321,
            "text": "The court may, at its discretion, call a person giving his evidence on affidavit and examine him as to the facts contained therein.",
            "labels": [
                "STA"
            ],
            "id": "29d8caa2d88c48328d6509ef8bfeb7d4_138"
        },
        {
            "start": 33322,
            "end": 33518,
            "text": "But if an application is made ei- ther by the prosecution or by the accused the court must call the person giving his evidence on affidavit, again to be examined as to the facts contained therein.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "cb4cbffebfb047518d0a7ca8078a082e_139"
        },
        {
            "start": 33519,
            "end": 33781,
            "text": "What would be the extent and nature of examination in each case is a different matter and that has to be reasonably construed in the light of the provision of Section 145(1) and having regard to the object and purpose of the entire scheme of Sections 143 to 146.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "fec445fd126e46cfa8f4e3bd17c1795c_140"
        },
        {
            "start": 33782,
            "end": 33900,
            "text": "The scheme of Sections 143 to 146 does not in any way affect the Judge's powers under Section 165 of the Evidence Act.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "ca116a92c548495bae857dab7be79d18_141"
        },
        {
            "start": 33902,
            "end": 34060,
            "text": "34. As a matter of fact, Section 145(2) expressly provides that the court may, if it thinks fit, summon and ex- amine any person giving evidence on affidavit.",
            "labels": [
                "STA"
            ],
            "id": "3b55bc0fcd0044018e97e5388bf06fc1_142"
        },
        {
            "start": 34061,
            "end": 34233,
            "text": "But how would the person giving evidence on affidavit be ex- amined, on being summoned to appear before the court on the application made by the prosecution or the accused?",
            "labels": [
                "ANALYSIS"
            ],
            "id": "b3e5dff1cffa4e2ca83ce0d4d58e0a37_143"
        },
        {
            "start": 34234,
            "end": 34355,
            "text": "The affidavit of the person so summoned that is already on the record is obviously in the nature of examination-in-chief.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "224e6097dfe946189e3242abaed6a1ee_144"
        },
        {
            "start": 34356,
            "end": 34575,
            "text": "Hence, on being summoned on the application made by the accused the deponent of the affidavit (the complainant or any of his witnesses) can only be subjected to cross-examination as to the facts stated in the affidavit.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "a3076c635d86457aa90829d5111a05d6_145"
        },
        {
            "start": 34576,
            "end": 34728,
            "text": "\n35. Insofar as the prosecution is concerned, the occasion to summon any of its witnesses who has given his evidence on affidavit may arise in two ways.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "82ef48cc906d4d8fbe541b23ecc70468_146"
        },
        {
            "start": 34729,
            "end": 34856,
            "text": "The prosecution may summon a person who has given his evi- dence on affidavit and has been cross-examined for \"re-examination\".",
            "labels": [
                "ANALYSIS"
            ],
            "id": "bf6b904aebd94370b7b52149e2746241_147"
        },
        {
            "start": 34857,
            "end": 35097,
            "text": "The prosecution may also have to summon a witness whose evidence is given on affidavit in case objection is raised by the defence regarding the validity and/or sufficiency of the proof of some document(s) submitted along with the affidavit.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "311b4993d5e44661bfe23883b5c7869e_148"
        },
        {
            "start": 35098,
            "end": 35266,
            "text": "In that event the witness may be summoned to appear before the court to cure the defect and to have the document(s) properly proved by following the correct legal mode.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "4bcbc05787824dffa25afcde9e0f18f0_149"
        },
        {
            "start": 35267,
            "end": 35360,
            "text": "This appears to us as the simple answer to the above question and the correct legal position.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "9642766f3d9a4f08b99565d369118e24_150"
        },
        {
            "start": 35361,
            "end": 35601,
            "text": "Any other meaning given to sub-section (2) of Section 145, as suggested by Mr Ranjit Kumar would make the provision of Section 145(1) nugatory and would com- pletely defeat the very scheme of trial as designed under Sections 143 to 147.\n36.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "0904df1511b84d65bde356504342bcd4_151"
        },
        {
            "start": 35602,
            "end": 35782,
            "text": "Mr Ranjit Kumar next submitted that Section 145(2) was identical to Section 296(2) of the Code of Criminal Procedure and this Court, in its decision in State Of Punjab v. Naib Din.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "1e391da37c524262b1e6df9964f083f1_152"
        },
        {
            "start": 35783,
            "end": 36085,
            "text": "(2001) 8 SCC 578 dealing with Section 296(2) of the Code made the following observation:\n     \"8. ... If any party to a lis wishes to examine the deponent of the affidavit it is open to him to make an application before the court that he requires the deponent to be examined or cross-examined in court.",
            "labels": [
                "STA"
            ],
            "id": "6979669ce6944142b08eee2243dfcd44_153"
        },
        {
            "start": 36086,
            "end": 36150,
            "text": "This is provided in sub- section (2) of Section 296 of the Code.",
            "labels": [
                "STA"
            ],
            "id": "b982e9305dd745c49d3478ba34d0415b_154"
        },
        {
            "start": 36151,
            "end": 36281,
            "text": "When any such application is made it is the duty of the court to call such person to the court for the purpose of being examined.\"",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "9d1d8889d5734f31a50e3bdbee394801_155"
        },
        {
            "start": 36283,
            "end": 36474,
            "text": "37. Mr Siddharth Bhatnagar representing the appellant in the appeal arising from SLP (Crl.) No. 1106 of 2007 also joined Mr Ranjit Kumar in the submission based on Section 296(2) of the Code.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "3a3247fd2c4b41bf8ce368daca6f0401_156"
        },
        {
            "start": 36475,
            "end": 36748,
            "text": "Mr Bhatnagar submitted that since Section 145(2) is identical to Section 296(2) of the Code, it should be interpreted in the light of the legislative history of Section 296(2) and he tried to take us into the details of the legislative his- tory of Section 296 of the Code.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "f31edda38b244a1abefb2e2e3a399c53_157"
        },
        {
            "start": 36750,
            "end": 36805,
            "text": "38. In our view the submission is wholly without merit.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "a0a425556b5f4ecfb39770bcdde04fed_158"
        },
        {
            "start": 36806,
            "end": 37002,
            "text": "Neither Section 296(2) of the Code nor the decision in Naib Din (2001) 8 SCC 578 has any relevance or application to the trial concerning a dishonoured cheque under Sections 143 to 146 of the Act.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "3116feb38ff042aebc3088d9a85afc43_159"
        },
        {
            "start": 37003,
            "end": 37288,
            "text": "The decision in Naib Din (2001) 8 SCC 578 was rendered in a totally different context and the issue before the Court was not, whether on being summoned on the application made by the accused, the person giving evidence on affidavit must begin his deposition with examination-in- chief.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "3e5719510d0a4910a16508572a71f7ba_160"
        },
        {
            "start": 37289,
            "end": 37421,
            "text": "The appellants are reading into the passage from the decision in Naib Din (2001) 8 SCC 578 something that was not said by the Court.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "266dbe789a79419791a1538643127f70_161"
        },
        {
            "start": 37423,
            "end": 37696,
            "text": "39. Moreover, the crucial difference between Section 296(2) of the Code and Section 145(2) of the Act is that the former deals with the evidence of a formal nature whereas under the latter provision, all evidences includ- ing substantive evidence may be given on affidavit.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "629c6097527d4babbea970bd826fd664_162"
        },
        {
            "start": 37697,
            "end": 37962,
            "text": "Section 296 is part of the elaborate procedure of a regular trial under the Code while the whole object of Section 145(2) of the Act is to design a much simpler and swifter trial procedure departing from the elaborate and time-consuming trial procedure of the Code.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "bd71af7de55c4862a6783776baa568d2_163"
        },
        {
            "start": 37963,
            "end": 38189,
            "text": "Hence, notwithstanding the apparent verbal similarity between Section 145(2) of the Act and Section 296(2) of the Code, it would be completely wrong to interpret the true scope and meaning of the one in the light of the other.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "6e8409c4a9a245df96fbeb10a01b7fb0_164"
        },
        {
            "start": 38190,
            "end": 38507,
            "text": "Neither the legislative history of Section 296(2) nor any decision on that section can persuade us to hold that under Section 145(2) of the Act, on being summoned at the instance of the accused the com- plainant or any of his witnesses should be first made to depose in examination-in-chief before cross- examination.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "b8b3a56a1a754b9890beda60c7a154be_165"
        },
        {
            "start": 38509,
            "end": 38792,
            "text": "40. Mr Ranjit Kumar next submitted that in giving evidence on affidavit, the deponent (the complainant or any of his witnesses) can introduce hearsay or irrelevant facts in evidence to which the accused could have objected if the deposition was made in court as examination-in-chief.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "05c66cd0368f4fd89152c9daa9e4818d_166"
        },
        {
            "start": 38793,
            "end": 39029,
            "text": "Hence, the accused must have the right to call the complainant (or his witness giving evidence on affidavit) into the witness box for examination-in- chief so as to get the inadmissible parts in the affidavit excluded from his evidence.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "fb816ea1c802408ea4fd9f919745d909_167"
        },
        {
            "start": 39030,
            "end": 39077,
            "text": "Once again the submis- sion is devoid of merit.",
            "labels": [
                "ARG_PETITIONER"
            ],
            "id": "70b99e9bcc854bc39622e84a98da7a79_168"
        },
        {
            "start": 39078,
            "end": 39187,
            "text": "It is noted above that the evidence given on affidavit by the complainant is subject to all just exceptions\".",
            "labels": [
                "ANALYSIS"
            ],
            "id": "b22e3f42f90a48f5b8fc2803e9bfa6fb_169"
        },
        {
            "start": 39188,
            "end": 39375,
            "text": "This simply means that the evidence given on affidavit must be admissible and it must not include inadmissible materials such as facts not relevant to the issue or any hearsay statements.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "14e98374446c4bcc9322d1f63223b2e1_170"
        },
        {
            "start": 39376,
            "end": 39616,
            "text": "In case the complainant's affidavits contain statements that are not admissible in evidence, it is always open to the accused to point those out to the court and the court would then surely deal with the objections in accor- dance with law.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "ba9dce3d812d44db8e2c0ffe3cc93a16_171"
        },
        {
            "start": 39618,
            "end": 39945,
            "text": "41. Mr Ranjit Kumar lastly submitted that when the complainant gives his evidence on affidavit, then the documents produced along with the affidavit(s) are not proved automatically and unless the accused admits those documents under Section 294 of the Code of Criminal Procedure, the documents must be proved by oral testimony.",
            "labels": [
                "ARG_RESPONDENT"
            ],
            "id": "b12785a1ea2d4d3fb322dd16da5fe188_172"
        },
        {
            "start": 39946,
            "end": 40100,
            "text": "We find no substance in this submission either and we see no reason why the affidavits should not also contain the formal proof of the enclosed documents.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "69b07ec280584e12b1dd4a88698be210_173"
        },
        {
            "start": 40101,
            "end": 40448,
            "text": "In case, however, the accused raises any objections with regard to the validity or sufficiency of the proof of the documents submitted along with the affidavit and if the objections are sustained by the court, it is always open to the prosecution to have the wit- ness concerned summoned and get the lacuna in the proof of the documents corrected.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "2415aa5481204eebb9de4f5268ea5331_174"
        },
        {
            "start": 40450,
            "end": 40687,
            "text": "42. Mr Ranjit Kumar also made a feeble attempt to contend that the provisions of Sections 143 to 147 in- serted in the Act with effect from 6-2-2003 would operate prospectively and would not apply to cases that were pending on that date.",
            "labels": [
                "ARG_RESPONDENT"
            ],
            "id": "b699cd83003e4164b03a37d73a275637_175"
        },
        {
            "start": 40688,
            "end": 40873,
            "text": "The High Court has considered the issue in great detail and has rightly taken the view that the provisions of Sections 143 to 147 do not take away any substantive rights of the accused.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "c355c6d0109349a58cd5b9b96af84a8b_176"
        },
        {
            "start": 40874,
            "end": 41155,
            "text": "Those provisions are not substantive but procedural in nature and would, therefore, undoubtedly, apply to the provisions are not substantive but procedural in nature and would, therefore, undoubtedly, apply to the cases that were pending on the date the provisions came into force.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "f1f36a4d65a842b48c24482312cb646e_177"
        },
        {
            "start": 41156,
            "end": 41287,
            "text": "We are fully in agreement and in order to buttress the view taken by the High Court we will only refer to a decision of this Court.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "e539e66001444c628cd9031dfae653fb_178"
        },
        {
            "start": 41289,
            "end": 41546,
            "text": "43. In Gurbachan Singh v. Satpal Singh (1990) 1 SCC 445 the Court was called upon to consider whether Section 113-A of the Evidence Act that created a presumption as to abetment of a suicide by a married woman would operate retrospectively or prospectively.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "06161fc827604594a2579ac10d3af6fc_179"
        },
        {
            "start": 41547,
            "end": 41572,
            "text": "The Court held:\n     \"37.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "88495d4da7b645bfb9a85bd04c9e5efc_180"
        },
        {
            "start": 41573,
            "end": 41810,
            "text": "The provisions of the said section do not create any new offence and as such it does not create any substantial right but it is merely a matter of procedure of evidence and as such it is retrospective and will be applicable to this case.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "e773c8c3411a418ebb7f6f0a0d86d278_181"
        },
        {
            "start": 41811,
            "end": 41991,
            "text": "It is profitable to refer in this connection to Halsbury's Laws of England, 4th Edn., Vol. 44, p. 570 wherein it has been stated that:\n     '922. Presumption against retrospection.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "dec0d2376ccc4d0d998212442b0e9cea_182"
        },
        {
            "start": 41992,
            "end": 42341,
            "text": "The general rule is that all statutes, other than those which are merely declaratory, or which relate only to matters of procedure or of evidence, are prima facie prospective, and retrospec- tive effect is not to be given to them unless, by express words or necessary implication, it appears that this was the intention of the legislature.'\n     38.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "07f64b7562dd4c9b9fcc369afe0301ae_183"
        },
        {
            "start": 42342,
            "end": 42485,
            "text": "It has also been stated in the said volume of Halsbury's Laws of England at p. 574 that:\n     '925. Statutes relating to procedure or evidence.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "205582762768439883d1dd8f429afe82_184"
        },
        {
            "start": 42486,
            "end": 42806,
            "text": "The presumption against retrospection does not apply to legisla- tion concerned merely with matters of procedure or of evidence; on the contrary, provisions of that nature are to be construed as retrospective unless there is a clear indication that such was not the intention of Parliament.' \" \n     (emphasis added)\n44.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "125aff6cd3f54e7fb9141d72ffb0bc2d_185"
        },
        {
            "start": 42807,
            "end": 43104,
            "text": "Coming now to the last question with regard to the right of the accused to give his evidence, like the com- plainant, on affidavit, the High Court has held that subject to the provisions of Sections 315 and 316 of the Code of Criminal Procedure the accused can also give his evidence on affidavit.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "958ce214565e454c924f61d2f133fd1b_186"
        },
        {
            "start": 43105,
            "end": 43250,
            "text": "The High Court was fully conscious that Section 145(1) does not provide for the accused to give his evidence, like the complainant, on affidavit.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "7f045a81c77746fabd284f0479b68609_187"
        },
        {
            "start": 43251,
            "end": 43515,
            "text": "But the High Court argued that there was no express bar in law against the accused giving his evi- dence on affidavit and more importantly providing a similar right to the accused would be in furtherance of the legislative intent to make the trial process swifter.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "2cbaed59647945cb857ad049f73d4703_188"
        },
        {
            "start": 43517,
            "end": 43687,
            "text": "45. In para 29 of the judgment, the High Court observed as follows:\n     \"It is true that Section 145(1) confers a right on the complainant to give evidence on affidavit.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "4c8c38be9e90471e9604ad0cfb8540f6_189"
        },
        {
            "start": 43688,
            "end": 43754,
            "text": "It does not speak of similar right being conferred on the accused.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "373fa9f6f5b24433b15e090853deab4c_190"
        },
        {
            "start": 43755,
            "end": 44071,
            "text": "The legislature in their wisdom may not have thought it proper to in- corporate the word 'accused' with the word 'complainant' in sub-section (1) of Section 145 in view of the immunity conferred on the accused from being compelled to be a witness against himself under Article 20(3) of the Constitution of India....\"",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "60bd2f2ab5284e0ab540027b545782d4_191"
        },
        {
            "start": 44072,
            "end": 44398,
            "text": "\nThen in para 31 of the judgment it observed:\n     \"... Merely because, Section 145(1) does not expressly permit the accused to do so, does not mean that the Magistrate cannot allow the accused to give his evidence on affidavit by applying the same analogy unless there is just and reasonable ground to refuse such permission.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "4c6cfca3a2c3460d9d2ef32ce53aafd8_192"
        },
        {
            "start": 44399,
            "end": 44504,
            "text": "There is no express bar on the accused to give evidence on affidavit either in the Act or in the Code....",
            "labels": [
                "ANALYSIS"
            ],
            "id": "55f6d1ff4419456eaea065124b27ce67_193"
        },
        {
            "start": 44505,
            "end": 44679,
            "text": "I find no justified reason to refuse permission to the accused to give his evidence on affidavit subiect to the provisions contained in Sections 315 and 316 of the Code \"\n46.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "1aa43b2407604db59617435c2b1abb00_194"
        },
        {
            "start": 44680,
            "end": 44822,
            "text": "On this issue, we are afraid that the High Court overreached itself and took a course that amounts to tak- ing over the legislative functions.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "cdd2da6098724239807d928461371baa_195"
        },
        {
            "start": 44823,
            "end": 45027,
            "text": "On a bare reading of Section 143 (sic Section 145) it is clear that the legisla- ture provided for the complainant to give his evidence on affidavit and did not provide for the accused to similarly do so.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "cfc75b922a64472d9607e4ab69764d9b_196"
        },
        {
            "start": 45028,
            "end": 45233,
            "text": "But the High Court thought that not mentioning the accused along with the complainant in sub-section (1) of Section 145 was merely an omission by the legislature that it could fill up without diffi- culty.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "cf4c5874d67d4fcdb6899cb5dd8eeca0_197"
        },
        {
            "start": 45234,
            "end": 45582,
            "text": "Even though the legislature in their wisdom did not deem it proper to incorporate the word \"accused with the word \"complainant\" in Section 145(1), it did not mean that the Magistrate could not allow the ac- cused to give his evidence on affidavit by applying the same analogy unless there was a just and reasonable ground to refuse such permission.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "134616c5a1424256b8f15172f125a792_198"
        },
        {
            "start": 45584,
            "end": 45653,
            "text": "47. There are two errors apparent in the reasoning of the High Court.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "0fe8c0d7aa5a4ab2b6eb627360c0984e_199"
        },
        {
            "start": 45654,
            "end": 45878,
            "text": "First, if the legislature in their wisdom did not think \"it proper to incorporate a word 'accused' with the word 'complainant' in Section 145(1)........, it was not open to the High Court to fill up the self-perceived blank.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "ce53b5525833494398e1cb9a82e7da5b_200"
        },
        {
            "start": 45879,
            "end": 46028,
            "text": "Secondly, the High Court was in error in drawing an analogy between the evidences of the complainant and the accused in a case of dishonoured cheque.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "a00e94c6e1d64e739f89dea56caf715b_201"
        },
        {
            "start": 46029,
            "end": 46148,
            "text": "The case of the complainant in a complaint under Section 138 of the Act would be based largely on documentary evidence.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "1023139215c940c4b61fac65d28ef947_202"
        },
        {
            "start": 46150,
            "end": 46305,
            "text": "48. The accused, on the other hand, in a large number of cases, may not lead any evidence at all and let the prosecution stand or fall on its own evidence.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "6cadcfa28e3649a2b95ad740e566a59b_203"
        },
        {
            "start": 46306,
            "end": 46588,
            "text": "In case the defence does lead any evidence, the nature of its evi- dence may not be necessarily documentary; in all likelihood the defence would lead other kinds of evidences to rebut the presumption that the issuance of the cheque was not in the discharge of any debt or liability.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "9c771edc90a34c50b2d43aa9c80cb675_204"
        },
        {
            "start": 46589,
            "end": 46731,
            "text": "This is the basic difference between the nature of the complainant's evidence and the evidence of the accused in a case of dishonoured cheque.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "b7d6896eeb33408da61520f47ab7bb11_205"
        },
        {
            "start": 46732,
            "end": 46872,
            "text": "It is, therefore, wrong to equate the defence evidence with the complainant's evidence and to extend the same option to the accused as well.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "14f0d3e8b9d245618caecd016cc7eb8b_206"
        },
        {
            "start": 46873,
            "end": 47089,
            "text": "\n49. Coming back to the first error in the High Court's reasoning, in the guise of interpretation it is not permissible for the Court to make additions in the law and to read into it something that is just not there.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "539ac213b540452cb7253b6be6d7448a_207"
        },
        {
            "start": 47090,
            "end": 47294,
            "text": "In Union of India v. Deoki Nandan Aggarwal 1992 Supp (1) SCC 323, (1992) 19 ATC 219 this Court sounded the note of caution against the court usurping the role of legislator in the guise of interpretation.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "57bb78ede5124e9f92710270bd83db35_208"
        },
        {
            "start": 47295,
            "end": 47327,
            "text": "The Court observed:\n     \"14....",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "1c6d42e541034c61b8c7091023d95177_209"
        },
        {
            "start": 47328,
            "end": 47503,
            "text": "It is not the duty of the court either to enlarge the scope of the legislation or the intention of the legislature when the language of the provision is plain and unambiguous.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "827d0ad4652d4b60a3c3754e1b9a5e27_210"
        },
        {
            "start": 47504,
            "end": 47625,
            "text": "The court cannot rewrite, recast or reframe the legis- lation for the very good reason that it has no power to legislate.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "6c0f474786b743fda7e06e2c86d98ad4_211"
        },
        {
            "start": 47626,
            "end": 47686,
            "text": "The power to legislate has not been conferred on the courts.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "a1c933a068e04685ad19cf861bf86d54_212"
        },
        {
            "start": 47687,
            "end": 47769,
            "text": "The court cannot add words to a statute or read words into it which are not there.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "e29dbcc9da73403ab0935a8c359e4b26_213"
        },
        {
            "start": 47770,
            "end": 47920,
            "text": "Assuming there is a defect or an omission in the words used by the legislature the court could not go to its aid to correct or make up the deficiency.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "28485cd0453f4f0fa6b07c7dd878c182_214"
        },
        {
            "start": 47921,
            "end": 47983,
            "text": "Courts shall decide what the law is and not what it should be.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "11fa3ef024a548e1a18d47a1c10a0bae_215"
        },
        {
            "start": 47984,
            "end": 48119,
            "text": "The court of course adopts a construction which will carry out the obvious intention of the legislature but could not legislate itself.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "b7a6e0f98b3246b6bfb0294402620e1b_216"
        },
        {
            "start": 48120,
            "end": 48273,
            "text": "But to invoke judicial ac- tivism to set at naught the legislative judgment is subversive of the constitutional harmony and comity of instrumentalities.\"",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "3f3a03920adf48559d9cb9414b64dbca_217"
        },
        {
            "start": 48275,
            "end": 48647,
            "text": "50. In Raghunath Rai Bareja v. Punjab National Bank (2007) 2 SCC 230 while observing that it is the task of the elected representatives of the people to legislate and not that of the Judge even if it results in hardship or inconvenience, the Supreme Court quoted in affirmation, the observation of Justice Frankfurter of the US Supreme Court which is as follows:\n     \"41.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "2c9fc5912fbd47c293bff95990999683_218"
        },
        {
            "start": 48648,
            "end": 48839,
            "text": "As stated by Justice Frankfurter of the US Supreme Court (see 'Of Law and Men: Papers and Addresses of Felix Frankfurter'):\n     'Even within their area of choice the courts are not at large.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "110b82ea24a246d7b87aea7883d69d2e_219"
        },
        {
            "start": 48840,
            "end": 48967,
            "text": "They are confined by the nature and scope of the judi- cial function in its particular exercise in the field of interpretation.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "a3d862f1f5ca4b11aadf210640fb3375_220"
        },
        {
            "start": 48968,
            "end": 49058,
            "text": "They are under the constraints imposed by the judicial function in our democratic society.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "4e091510a8ab4771b861b696049fc98c_221"
        },
        {
            "start": 49059,
            "end": 49227,
            "text": "As a matter of verbal recognition certainly, no one will gainsay that the function in construing a statute is to ascertain the meaning of words used by the legislature.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "2161cd11e23b47a584ceeadabfa3bc4f_222"
        },
        {
            "start": 49228,
            "end": 49322,
            "text": "To go beyond it is to usurp a power which our democracy has lodged in its elected legislature.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "cd212959a8b6451bac319eb2b0d89249_223"
        },
        {
            "start": 49323,
            "end": 49440,
            "text": "The great Judges have constantly admon- ished their brethren of the need for discipline in observing the limitations.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "7251cbeee0484e56ada2dc4246bd5db3_224"
        },
        {
            "start": 49441,
            "end": 49517,
            "text": "A Judge must not rewrite a statute, nei- ther to enlarge nor to contract it.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "9da42ae1fed246778584715caf18c3a6_225"
        },
        {
            "start": 49518,
            "end": 49652,
            "text": "Whatever temptations the statesmanship of policy-making might wisely suggest, construction must eschew interpolation and evisceration.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "c040e10c928b485787fd3e3399bc2cf0_226"
        },
        {
            "start": 49653,
            "end": 49692,
            "text": "He must not read in by way of creation.",
            "labels": [
                "ANALYSIS"
            ],
            "id": "94a626f2ac464da69b4cd48e6e382a8a_227"
        },
        {
            "start": 49693,
            "end": 49779,
            "text": "He must not read out except to avoid patent nonsense or internal contradiction.\" \"\n51.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "61b6e9aa7c6b48b384497c3c4ea92165_228"
        },
        {
            "start": 49780,
            "end": 50073,
            "text": "In Duport Steels Ltd. v. Sirs (1980) 1 WLR 142, (1980) 1 All ER 529 (HL) Lord Scarman expounded the legal position in the following words: (WLR p. 168 G-H: All ER p. 534)\n     \"But in the field of statute law the Judge must be obedient to the will of Parliament as expressed in its enactments.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "2a225a7257114ccf9daa824c15dac549_229"
        },
        {
            "start": 50074,
            "end": 50250,
            "text": "In this field Parliament makes, and unmakes, the law: the Judge's duty is to interpret and to apply the law, not to change it to meet the Judge's idea of what justice requires.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "00b8cc7a6b4845798bc29e00d03f6026_230"
        },
        {
            "start": 50251,
            "end": 50369,
            "text": "Interpretation does, of course, imply in the interpreter a power of choice where differing constructions are possible.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "c9651679401e47c098721cd557667e6e_231"
        },
        {
            "start": 50370,
            "end": 50504,
            "text": "But our law requires the Judge to choose the construc- tion which in his judgment best meets the legislative purpose of the enactment.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "b00d559a04824557a211fabe79e8edf1_232"
        },
        {
            "start": 50505,
            "end": 50616,
            "text": "If the result be unjust but inevitable, the Judge may say so and invite Parliament to reconsider its provision.",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "2c0b51955f154e549b6f901c18b6bc80_233"
        },
        {
            "start": 50617,
            "end": 50651,
            "text": "But he must not deny the statute.\"",
            "labels": [
                "PRE_RELIED"
            ],
            "id": "3eb29ee6ca50405c8f9f69e233415f55_234"
        },
        {
            "start": 50653,
            "end": 50986,
            "text": "52. In the light of the above we have no hesitation in holding that the High Court was in error in taking the view, that on a request made by the accused the Magistrate may allow him to tender his evidence on affidavit and consequently, we set aside the direction as contained in sub-para (r) of para 45 of the High Court judg- ment.",
            "labels": [
                "RATIO"
            ],
            "id": "d4e7240c68b142d282789067437fe159_235"
        },
        {
            "start": 50987,
            "end": 51050,
            "text": "The appeal arising from SLP (Crl.) No. 3915 of 2006 is allowed.",
            "labels": [
                "RPC"
            ],
            "id": "c8fcba897c914420b0cdda2581b687d5_236"
        },
        {
            "start": 51052,
            "end": 51100,
            "text": "53. All the remaining six appeals are dismissed.",
            "labels": [
                "RPC"
            ],
            "id": "5449f4cb38cc4460ae4a24a38ea9b127_237"
        },
        {
            "start": 51102,
            "end": 51142,
            "text": "54. There shall be no order as to costs.",
            "labels": [
                "RPC"
            ],
            "id": "759481cfaf3b4336aa5fe01d90cebdda_238"
        }
    ]
}