{
    "text": [
        {
            "Text": "It was, therefore, beyond doubt that in the event an application is made by the accused, the court would be obliged to summon the person giving evidence on affidavit in terms of Section 145(1) without having any discretion in the matter."
        },
        {
            "Text": "Mr Ranjit Kumar, learned Senior Advocate, appearing for the appellant in appeal arising from SLP (Crl.) No. 4760 of 2006 pointed out that sub-section (2) of Section 145 uses both the words, \"may\" (with ref- erence to the court) and shall (with reference to the prosecution or the accused)."
        },
        {
            "Text": "This, ac- cording to him, coupled with the use of the word shall with reference to the application made by the ac- cused made it quite clear that a person giving his evidence on affidavit, on being summoned under Section 145(2) at the instance of the accused must begin his deposition with examination-in-chief, before he may be cross-examined by the accused."
        },
        {
            "Text": "In this regard he submitted that Section 145 did not override the Evidence Act or the Negotiable Instruments Act or any other law except the Code of Criminal Procedure."
        },
        {
            "Text": "There can be no disagreement with this part of the submission but the question is when the person who has given his evidence on affidavit appears in court, whether it is also open to the accused to insist that before cross-examining him as to the facts stated in the affidavit he must first depose in examination-in-chief and be required to verbally state what is already said in the affidavit."
        },
        {
            "Text": "37. Mr Siddharth Bhatnagar representing the appellant in the appeal arising from SLP (Crl.) No. 1106 of 2007 also joined Mr Ranjit Kumar in the submission based on Section 296(2) of the Code."
        },
        {
            "Text": "The appellants are reading into the passage from the decision in Naib Din (2001) 8 SCC 578 something that was not said by the Court."
        },
        {
            "Text": "Hence, the accused must have the right to call the complainant (or his witness giving evidence on affidavit) into the witness box for examination-in- chief so as to get the inadmissible parts in the affidavit excluded from his evidence."
        },
        {
            "Text": "40. Mr Ranjit Kumar next submitted that in giving evidence on affidavit, the deponent (the complainant or any of his witnesses) can introduce hearsay or irrelevant facts in evidence to which the accused could have objected if the deposition was made in court as examination-in-chief."
        },
        {
            "Text": "32. Mr Siddharth Bhatnagar, learned counsel for the appellant in the appeal arising from SLP (Crl.) No. 1106 of 2007 also joined Mr Ranjit Kumar in the submission based on literal interpretation."
        },
        {
            "Text": "31. Mr Ranjit Kumar referred to Section 137 of the Evidence Act, that defines \"examination-in-chief, \"cross-examination\" and \"re-examination\" and on that basis sought to argue that the word \"examine\" oc- curring in Section 145(2) must be construed to mean all the three kinds of examination of a witness."
        },
        {
            "Text": "Mr Bhatnagar submitted that since Section 145(2) is identical to Section 296(2) of the Code, it should be interpreted in the light of the legislative history of Section 296(2) and he tried to take us into the details of the legislative his- tory of Section 296 of the Code."
        },
        {
            "Text": "He further submitted that the plain language of Section 145(2) was clear and unambiguous and was capable of only one meaning and, therefore, the provision must be understood in its literl sense and the High Court was in error in resorting to purposive interpretation of the provision."
        },
        {
            "Text": "He also submit- ted that ordinarily the rule of literal construction should not be departed from, particularly when the words of the statute are clear and unambiguous."
        },
        {
            "Text": "In support of the submission he relied upon the de- cisions of this Court in Dental Council of India v. Hari Prakash (2001) 8 SCC 61 and Nathi Devi v. Radha Devi Gupta."
        },
        {
            "Text": "Mr Ranjit Kumar next submitted that Section 145(2) was identical to Section 296(2) of the Code of Criminal Procedure and this Court, in its decision in State Of Punjab v. Naib Din."
        },
        {
            "Text": "Once again the submis- sion is devoid of merit."
        },
        {
            "Text": "(2005) 2 SCC 271."
        }
    ]
}