{
    "ANALYSIS": [
        {
            "text": "\n3. Answering the questions after a detailed and careful consideration of all the relevant provisions and earlier decisions of courts, the High Court held that the person (the complainant or his witness) giving evidence on affidavit may be summoned by the court for putting questions as envisaged under Section 165 of the Evidence Act, 1872 (vide para 24 of the judgment)."
        },
        {
            "text": "He would also be summoned on an application made by the accused but the right of the accused is limited to cross-examination of the witness."
        },
        {
            "text": "In terms of Section 145(2) the accused can undoubtedly cross-examine a person whose evidence is given on affidavit but the ac- cused cannot insist that the witness, on coming to court, should first depose in examination-in-chief even in respect of matters which are already stated by him on affidavit (vide para 25 of the judgment)."
        },
        {
            "text": "\n4. The High Court further explained that for the prosecution the occasion to summon any of its witnesses who have given their evidence on affidavit may arise in two ways."
        },
        {
            "text": "The prosecution may summon a person who has given his evidence on affidavit and has been cross-examined for re-examination."
        },
        {
            "text": "This right of the prosecution, the High Court observed, was not in dispute before it."
        },
        {
            "text": "The prosecution may also have to sum- mon a witness whose evidence is given on affidavit in case objection is raised by the defence regarding the va- lidity and/or sufficiency of the proof of some document(s) submitted along with the affidavit."
        },
        {
            "text": "In that event the witness may be summoned to appear before the court to cure the defect and to have the document(s) properly proved by following the correct legal mode (vide para 26 of the judgment).\n5."
        },
        {
            "text": "The High Court then considered the claim of the accused that any evidence in defence, like the complainant's evidence, may also be given on affidavit."
        },
        {
            "text": "There is no express bar on the accused to give evidence on affidavit either in the Act or in the Code........"
        },
        {
            "text": "I find no justified reason to refuse permission to the accused to give his evidence on affidavit subject to the provisions contained in Sections 315 and 316 of the Code.\""
        },
        {
            "text": "\n6. Coming then to Question B, the High Court had no difficulty in holding that the provisions of sub-sec- tions (1) and (2) of Section 145 were not substantive but only procedural in nature and, therefore, those provisions would be applicable to the cases pending on the date they came into force."
        },
        {
            "text": "Apart from considering the two questions the High Court also laid down, on the request of the parties, a number of guidelines [vide sub-paras (a) to (r) of para 45 of the judgment] in regard to the procedure that the trial court, the com- plainant and the accused should follow in a dishonoured cheque trial on a complaint made under Section 138 of the Act."
        },
        {
            "text": "We may have to refer to some of those guidelines later, at an appropriate place in this judgment."
        },
        {
            "text": "[Appeals arising from SLP (Crl.) No. 4760 of 2006, SLP (Crl.) No. 5689 of 2006, SLP (Crl.) No. 1106 of 2007, SLP (Crl.) No. 6442 of 2007, SLP (Crl.) No. 6443 of 2007, SLP (Crl.) No. 6703 of 2007.]\n     2."
        },
        {
            "text": "Whether the provisions of sub-sections (1) and (2) of Section 145 of the Act would apply to proceedings that were pending on 6-2-2003, the date on which those provisions were inserted in the Act?"
        },
        {
            "text": "[Appeal arising from SLP (Crl.) No. 4760 of 2006.]\n     3."
        },
        {
            "text": "Whether the right to give evidence on affidavit as provided to the complainant under Section 145(1) of the Act is also available to the accused?"
        },
        {
            "text": "[Appeal arising from SLP (Crl.) No. 3915 of 2006.]\n8."
        },
        {
            "text": "For a proper appreciation of the issues it would be necessary to examine the relevant legal provisions and to ascertain the objects and reasons for which those provisions were brought into existence by making amendments in the Negotiable Instruments Act, 1881."
        },
        {
            "text": "The Negotiable Instruments Act was amended first by the Banking, Public Financial Institutions and Negotiable Instruments Laws (Amendment) Act, 1988 and a second time by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002."
        },
        {
            "text": "\n10. Section 139 created a presumption (rebuttable!) that the cheque was issued by the drawer in discharge of any debt or liability owed by him to its holder."
        },
        {
            "text": "Section 140 provided that it would not be open to the accused in a prosecution under Section 138 to take the plea that when he issued the cheque he had no reason to be- lieve that on presentation, the cheque may be dishonoured for the reasons stated in that section."
        },
        {
            "text": "Section 141 dealt with offences by companies."
        },
        {
            "text": "Section 142 laid down the conditions subject to which alone the court would take cognizance of any offence punishable under Section 138 of the Act."
        },
        {
            "text": "Defences which may or may not be allowed in any prosecution for such offence have also been provided to make the provisions effective."
        },
        {
            "text": "Usual provision relating to offences by com- panies has also been included in the said new Chapter."
        },
        {
            "text": "In order to ensure that genuine and honest bank customers are not harassed or put to inconvenience, sufficient safeguards have also been provided in the proposed new Chapter."
        },
        {
            "text": "The speech of the Minister of Finance on 2-12-1988 in course of the debate on the Bill in the Lok Sabha tells us that Chapter XVII was inserted in the Act, in light of the report submitted in the year 1975 by the Committee on Banking Laws headed by Dr. Rajamannar."
        },
        {
            "text": "It appears that in the course of the debate some Members had expressed the view that the provisions of Chapter XVII sought to be inserted in the Act, con- tained very abnormal, rather very dangerous provisions, in that a kind of civil liability is supposed to be con- verted into a kind of criminal act which would have far-reaching consequences."
        },
        {
            "text": "13. Dispelling the apprehensions of those Members the Minister pointed out that the proposed amendments were along the same lines as the law prevailing in other countries such as UK, USA, Belgium, Portugal, Argentina, etc."
        },
        {
            "text": "Further, in regard to the object of the provisions, the Minister stated as follows:\n     \"In fact, the whole purpose of bringing about this provision is to make the drawing of cheque a regular mode of payment."
        },
        {
            "text": "Unfortunately, today if a cheque is given to a party, they will not consider it a sufficient means of pay- ment, they will insist that unless the cheque is encashed, they will not take that as a kind of payment made.\"\n    (emphasis added)\n14."
        },
        {
            "text": "The Minister then elaborated on the safeguards provided in the law to save an honest drawer from com- ing under the rigours of the section due to any bona fide mistake and finally went on to say as follows:\n     \"But in spite of time for payment and all other provisions that are made, if the party is not able to make good the amount of money which he owes to a particular party and in spite of the notice also he does not act, the conclusion is inescapable that he will be prosecuted, legal action will have to be taken."
        },
        {
            "text": "It is for the court to take a decision, whether he be imprisoned for one year, or double the amount that would be paid as fine or both things will have to be taken together."
        },
        {
            "text": "Ultimately, it is for the court to take a decision."
        },
        {
            "text": "But these are the provisions which have been provided for so that the parties drawing the cheques are careful enough to see that there are enough resources available in their bank account and if a cheque is drawn, it will not be returned.\"\n    (emphasis added)\n15."
        },
        {
            "text": "The provisions of the newly inserted Chapter XVII, on coming into force with effect from 1-4-1989, brought in a veritable deluge of cases in the criminal court system."
        },
        {
            "text": "In the metropolitan cities and the com- mercial centres of the country, it almost appeared that the main function of the Magistrate's court was to re- cover monies on behalf of parties on the wrong end of the commercial transactions that had gone sour."
        },
        {
            "text": "16. Complaints under Section 138 of the Act came to be filed in such large numbers that it became impossible for the courts to handle them within a reasonable time and it also had a highly adverse effect on the courts' normal work in ordinary criminal matters."
        },
        {
            "text": "A remedial measure was urgently required and the legislature took action by introducing further amendments in the Act by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002."
        },
        {
            "text": "The 2002 Amendment inserted in the Act for the first time Sections 143 to 147 besides bringing about a number of changes in the existing provisions of Sections 138 to 142.\n17."
        },
        {
            "text": "Section 143 gave to the court the power to try cases summarily; Section 144 provided for the mode of ser- vice of summons; Section 145 made it possible for the complainant to give his evidence on affidavit; Section 146 provided that the bank's slip would be prima facie evidence of certain facts and Section 147 made the of- fences under the Act compoundable.\n18."
        },
        {
            "text": "The Statement of Objects and Reasons appended to the Bill stated as follows:\n     \"The Negotiable Instruments Act, 1881 was amended by the Banking, Public Financial Institutions and Negotiable Instruments Laws (Amendment) Act, 1988 wherein a new Chapter XVII was incorporated for penalties in case of dishonour of cheques due to insufficiency of funds in the account of the drawer of the cheque."
        },
        {
            "text": "These provisions were incorporated with a view to encourage the culture of use of cheques and enhancing the credibility of the in- strument."
        },
        {
            "text": "The existing provisions in the Negotiable Instruments Act, 1881, namely, Sections 138 to 142 in Chapter XVII have been found deficient in dealing with dishonour of cheques."
        },
        {
            "text": "Not only the punishment provided in the Act has proved to be inadequate, the procedure prescribed for the courts to deal with such matters has been found to be cumbersome."
        },
        {
            "text": "The courts are unable to dispose of such cases expeditiously in a time-bound manner in view of the procedure contained in the Act."
        },
        {
            "text": "2. A large number of cases are reported to be pending under Sections 138 to 142 of the Negotiable Instruments Act in various courts in the country."
        },
        {
            "text": "Keeping in view the large number of complaints under the said Act pending in var- ious courts, a working group was constituted to review Section 138 of the Negotiable Instruments Act, 1881 and make recommendations as to what changes were needed to effectively achieve the purpose of that section."
        },
        {
            "text": "3. The recommendations of the Working Group along with other representations from various institutions and or- ganisations were examined by the Government in consultation with Reserve Bank of India and other legal experts, and a Bill, namely, the Negotiable Instruments (Amendment) Bill, 2001 was introduced in the Lok Sabha on 24-7- 2001."
        },
        {
            "text": "The Bill was referred to the Standing Committee on Finance which made certain recommendations in its re- port submitted to Lok Sabha in November 2001."
        },
        {
            "text": "4. Keeping in view the recommendations of the Standing Committee on Finance and other representations, it has been decided to bring out, inter alia, the following amendments in the Negotiable Instruments Act, 1881, namely:\n     ___      (i) to increase the punishment as prescribed under the Act from one year to two years;\n     (ii) to increase the period for issue of notice by the payee to the drawer from 15 days to 30 days;\n     (iii) to provide discretion to the court to waive the period of one month, which has been prescribed for taking cog- nizance of the case under the Act;\n     (iv) to prescribe procedure for dispensing with preliminary evidence of the complainant;\n     (v) to prescribe procedure for servicing of summons to the accused or witness by the court through speed post or empanelled private couriers;\n     (vi) to provide for summary trial of the cases under the Act with a view to speeding up disposal of cases;\n     (vii) to make the offences under the Act compoundable;\n     (viii) to exempt those Directors from prosecution under Section 141 of the Act who are nominated as Directors of a company by virtue of their holding any office or employment in the Central Government or State Government or a financial corporation owned or controlled by the Central Government, or the State Government, as the case may be;\n     (ix) to provide that the Magistrate trying an offence shall have power to pass sentence of imprisonment for a term exceeding one year and amount of fine exceeding five thousand rupees;\n     (x) to make the Information Technology Act, 2000 applicable to the Negotiable Instruments Act, 1881 in relation to electronic cheques and truncated cheques subject to such modifications and amendments as the Central Government, in consultation with the Reserve Bank of India, considers necessary for carrying out the purposes of the Act, by notification in the Official Gazette; and      (xi) to amend definitions of 'bankers' books' and 'certified copy' given in the Bankers' Books Evidence Act, 1891.\n5."
        },
        {
            "text": "The proposed amendments in the Act are aimed at early disposal of cases relating to dishonour of cheques, en- hancing punishment for offenders, introducing electronic image of a truncated cheque and a cheque in the elec- tronic form as well as exempting an official nominee Director from prosecution under the Negotiable Instruments Act, 1881."
        },
        {
            "text": "Though, in these appeals, we are mainly concerned with the provisions of Section 145, it would be useful here to take a look at all the five sections introduced by the 2002 Amendment:\n     \"143. Power of court to try cases"
        },
        {
            "text": "20. It may be noted that the provisions of Sections 143, 144, 145 and 147 expressly depart from and override the provisions of the Code of Criminal Procedure, the main body of adjective law for criminal trials."
        },
        {
            "text": "The provisions of Section 146 similarly depart from the principles of the Evidence Act."
        },
        {
            "text": "Section 143 makes it pos- sible for the complaints under Section 138 of the Act to be tried in the summary manner, except, of course, for the relatively small number of cases where the Magistrate feels that the nature of the case is such that a sentence of imprisonment for a term exceeding one year may have to be passed or that it is, for any other rea- son, undesirable to try the case summarily."
        },
        {
            "text": "21. It is, however, significant that the procedure of summary trials is adopted under Section 143 subject to the qualification \"as far as possible\", thus, leaving sufficient flexibility so as not to affect the quick flow of the qualification \"as far as possible, thus, leaving sufficient flexibility so as not to affect the quick flow of the trial process."
        },
        {
            "text": "Even while following the procedure of summary trials, the non obstante clause and the ex- pression \"as far as possible\" used in Section 143 coupled with the non obstante clause in Section 145 allow for the evidence of the complainant to be given on affidavit, that is, in the absence of the accused."
        },
        {
            "text": "This would have been impermissible (even in a summary trial under the Code of Criminal Procedure) in view of Sections 251 and 254 and especially Section 273 of the Code."
        },
        {
            "text": "The accused, however, is fully protected, as under sub- section (2) of Section 145 he has the absolute and unqualified right to have the complainant and any or all of his witnesses summoned for    cross-examination."
        },
        {
            "text": "Section 144 makes the process of service of summons simpler and cuts down the long time ordinarily consumed in service of summons in a regular civil suit or a criminal trial."
        },
        {
            "text": "\n23. Section 145 with its non obstante clause, as noted above, makes it possible for the evidence of the com- plainant to be taken in the absence of the accused."
        },
        {
            "text": "But the affidavit of the complainant (or any of his wit- nesses) may be read in evidence \"subject to all just exceptions\"."
        },
        {
            "text": "In other words, anything inadmissible in evi- dence e.g irrelevant facts or hearsay matters would not be taken in as evidence, even though stated on affidavit."
        },
        {
            "text": "Section 147 makes the of- fences punishable under the Act, compoundable."
        },
        {
            "text": "25. It is not difficult to see that Sections 143 to 147 lay down a kind of a special code for the trial of offences under Chapter XVII of the Negotiable Instruments Act and Sections 143 to 147 were inserted in the Act by the Negotiable Instruments (Amendment and Miscellaneous Provisions) Act, 2002 to do away with all the stages and processes in a regular criminal trial that normally cause inordinate delay in its conclusion and to make the trial procedure as expeditious as possible without in any way compromising on the right of the ac- cused for a fair trial."
        },
        {
            "text": "Here we must take notice of the fact that cases under Section 138 of the Act have been coming in such great multitude that even the introduction of such radical measures to make the trial proce- dure simplified and speedy has been of little help and cases of dishonoured cheques continue to pile up giving rise to an unbearable burden on the criminal court system.\n26."
        },
        {
            "text": "The Law Commission in its Report Number 213 sent to the Union Minister for Law and Justice on 24- 11-2008 advocated the setting up of Fast Track Magisterial Courts for dealing with the huge pendency of dis- honoured cheque cases."
        },
        {
            "text": "In Para 1.5 of the Report it was stated as follows:\n     \"1.5."
        },
        {
            "text": "Over 38 lakhs cheque bouncing cases are pending in various courts in the country."
        },
        {
            "text": "There are 7,66,974 cases pending in criminal courts in Delhi at the Magisterial level as on 1-6-2008."
        },
        {
            "text": "Out of this huge workload, a substantial portion is of cases under Section 138 of the Negotiable Instruments Act which alone count for 5,14,433 cases (cheque bouncing)."
        },
        {
            "text": "According to Gujarat High Court sources, there are approximately two lakhs cheque bouncing cases all over the State, with the majority of them (84,000 cases) in Ahmedabad, followed by Surat, Vadodara and Rajkot."
        },
        {
            "text": "The number of complaints which are pending in Bombay courts seriously cast shadow on the credibility of our trade, commerce and         business."
        },
        {
            "text": "\n      (b) Cases under Section 498-A of the Penal Code, 1860."
        },
        {
            "text": "\n      (c) Cases under Section 143 of the Negotiable Instruments Act, 1881."
        },
        {
            "text": "Once it is realised that Sections 143 to 147 were designed especially to lay down a much simplified procedure for the trial of dishonoured cheque cases with the sole object that the trial of those cases should follow a course even swifter than a summary trial and once it is seen that even the special procedure failed to effectively and expeditiously handle the vast multitude of cases coming to the court, the claim of the accused that on being summoned under Section 145(2), the complainant or any of his witnesses whose evidence is given on affidavit must be made to depose in examination-in-chief all over again plainly appears to be a demand for meaningless duplication, apparently aimed at delaying the trial."
        },
        {
            "text": "30. Nevertheless, the submissions made on behalf of the parties must be taken note of and properly dealt with."
        },
        {
            "text": "We find nothing in Section 145(2) to suggest that."
        },
        {
            "text": "But if an application is made ei- ther by the prosecution or by the accused the court must call the person giving his evidence on affidavit, again to be examined as to the facts contained therein."
        },
        {
            "text": "What would be the extent and nature of examination in each case is a different matter and that has to be reasonably construed in the light of the provision of Section 145(1) and having regard to the object and purpose of the entire scheme of Sections 143 to 146."
        },
        {
            "text": "The scheme of Sections 143 to 146 does not in any way affect the Judge's powers under Section 165 of the Evidence Act."
        },
        {
            "text": "But how would the person giving evidence on affidavit be ex- amined, on being summoned to appear before the court on the application made by the prosecution or the accused?"
        },
        {
            "text": "The affidavit of the person so summoned that is already on the record is obviously in the nature of examination-in-chief."
        },
        {
            "text": "Hence, on being summoned on the application made by the accused the deponent of the affidavit (the complainant or any of his witnesses) can only be subjected to cross-examination as to the facts stated in the affidavit."
        },
        {
            "text": "\n35. Insofar as the prosecution is concerned, the occasion to summon any of its witnesses who has given his evidence on affidavit may arise in two ways."
        },
        {
            "text": "The prosecution may summon a person who has given his evi- dence on affidavit and has been cross-examined for \"re-examination\"."
        },
        {
            "text": "The prosecution may also have to summon a witness whose evidence is given on affidavit in case objection is raised by the defence regarding the validity and/or sufficiency of the proof of some document(s) submitted along with the affidavit."
        },
        {
            "text": "In that event the witness may be summoned to appear before the court to cure the defect and to have the document(s) properly proved by following the correct legal mode."
        },
        {
            "text": "This appears to us as the simple answer to the above question and the correct legal position."
        },
        {
            "text": "Any other meaning given to sub-section (2) of Section 145, as suggested by Mr Ranjit Kumar would make the provision of Section 145(1) nugatory and would com- pletely defeat the very scheme of trial as designed under Sections 143 to 147.\n36."
        },
        {
            "text": "38. In our view the submission is wholly without merit."
        },
        {
            "text": "Neither Section 296(2) of the Code nor the decision in Naib Din (2001) 8 SCC 578 has any relevance or application to the trial concerning a dishonoured cheque under Sections 143 to 146 of the Act."
        },
        {
            "text": "39. Moreover, the crucial difference between Section 296(2) of the Code and Section 145(2) of the Act is that the former deals with the evidence of a formal nature whereas under the latter provision, all evidences includ- ing substantive evidence may be given on affidavit."
        },
        {
            "text": "Section 296 is part of the elaborate procedure of a regular trial under the Code while the whole object of Section 145(2) of the Act is to design a much simpler and swifter trial procedure departing from the elaborate and time-consuming trial procedure of the Code."
        },
        {
            "text": "Hence, notwithstanding the apparent verbal similarity between Section 145(2) of the Act and Section 296(2) of the Code, it would be completely wrong to interpret the true scope and meaning of the one in the light of the other."
        },
        {
            "text": "Neither the legislative history of Section 296(2) nor any decision on that section can persuade us to hold that under Section 145(2) of the Act, on being summoned at the instance of the accused the com- plainant or any of his witnesses should be first made to depose in examination-in-chief before cross- examination."
        },
        {
            "text": "It is noted above that the evidence given on affidavit by the complainant is subject to all just exceptions\"."
        },
        {
            "text": "This simply means that the evidence given on affidavit must be admissible and it must not include inadmissible materials such as facts not relevant to the issue or any hearsay statements."
        },
        {
            "text": "In case the complainant's affidavits contain statements that are not admissible in evidence, it is always open to the accused to point those out to the court and the court would then surely deal with the objections in accor- dance with law."
        },
        {
            "text": "We find no substance in this submission either and we see no reason why the affidavits should not also contain the formal proof of the enclosed documents."
        },
        {
            "text": "In case, however, the accused raises any objections with regard to the validity or sufficiency of the proof of the documents submitted along with the affidavit and if the objections are sustained by the court, it is always open to the prosecution to have the wit- ness concerned summoned and get the lacuna in the proof of the documents corrected."
        },
        {
            "text": "The High Court has considered the issue in great detail and has rightly taken the view that the provisions of Sections 143 to 147 do not take away any substantive rights of the accused."
        },
        {
            "text": "Those provisions are not substantive but procedural in nature and would, therefore, undoubtedly, apply to the provisions are not substantive but procedural in nature and would, therefore, undoubtedly, apply to the cases that were pending on the date the provisions came into force."
        },
        {
            "text": "We are fully in agreement and in order to buttress the view taken by the High Court we will only refer to a decision of this Court."
        },
        {
            "text": "The provisions of the said section do not create any new offence and as such it does not create any substantial right but it is merely a matter of procedure of evidence and as such it is retrospective and will be applicable to this case."
        },
        {
            "text": "Coming now to the last question with regard to the right of the accused to give his evidence, like the com- plainant, on affidavit, the High Court has held that subject to the provisions of Sections 315 and 316 of the Code of Criminal Procedure the accused can also give his evidence on affidavit."
        },
        {
            "text": "But the High Court argued that there was no express bar in law against the accused giving his evi- dence on affidavit and more importantly providing a similar right to the accused would be in furtherance of the legislative intent to make the trial process swifter."
        },
        {
            "text": "There is no express bar on the accused to give evidence on affidavit either in the Act or in the Code...."
        },
        {
            "text": "On this issue, we are afraid that the High Court overreached itself and took a course that amounts to tak- ing over the legislative functions."
        },
        {
            "text": "On a bare reading of Section 143 (sic Section 145) it is clear that the legisla- ture provided for the complainant to give his evidence on affidavit and did not provide for the accused to similarly do so."
        },
        {
            "text": "But the High Court thought that not mentioning the accused along with the complainant in sub-section (1) of Section 145 was merely an omission by the legislature that it could fill up without diffi- culty."
        },
        {
            "text": "Even though the legislature in their wisdom did not deem it proper to incorporate the word \"accused with the word \"complainant\" in Section 145(1), it did not mean that the Magistrate could not allow the ac- cused to give his evidence on affidavit by applying the same analogy unless there was a just and reasonable ground to refuse such permission."
        },
        {
            "text": "47. There are two errors apparent in the reasoning of the High Court."
        },
        {
            "text": "First, if the legislature in their wisdom did not think \"it proper to incorporate a word 'accused' with the word 'complainant' in Section 145(1)........, it was not open to the High Court to fill up the self-perceived blank."
        },
        {
            "text": "Secondly, the High Court was in error in drawing an analogy between the evidences of the complainant and the accused in a case of dishonoured cheque."
        },
        {
            "text": "The case of the complainant in a complaint under Section 138 of the Act would be based largely on documentary evidence."
        },
        {
            "text": "48. The accused, on the other hand, in a large number of cases, may not lead any evidence at all and let the prosecution stand or fall on its own evidence."
        },
        {
            "text": "In case the defence does lead any evidence, the nature of its evi- dence may not be necessarily documentary; in all likelihood the defence would lead other kinds of evidences to rebut the presumption that the issuance of the cheque was not in the discharge of any debt or liability."
        },
        {
            "text": "This is the basic difference between the nature of the complainant's evidence and the evidence of the accused in a case of dishonoured cheque."
        },
        {
            "text": "It is, therefore, wrong to equate the defence evidence with the complainant's evidence and to extend the same option to the accused as well."
        },
        {
            "text": "\n49. Coming back to the first error in the High Court's reasoning, in the guise of interpretation it is not permissible for the Court to make additions in the law and to read into it something that is just not there."
        },
        {
            "text": "The great Judges have constantly admon- ished their brethren of the need for discipline in observing the limitations."
        },
        {
            "text": "He must not read in by way of creation."
        }
    ]
}