{
    "PRE_RELIED": [
        {
            "text": "73,000 cases were filed under Section 138 of the Negotiable Instruments Act (cheque bouncing) on a single day by a private telecom company before a Bangalore court, informed the Chief Justice of India, K.G Balakrishnan, urging the Government to appoint more Judges to deal with 1.8 crores pending cases in the country."
        },
        {
            "text": "Immediate steps have to be taken by all concerned to ensure restoration of the cred- ibility of trade, commerce and business.\"\n27."
        },
        {
            "text": "The situation arising from the mounting arrears is so grave that in the \"Vision Statement\" presented by the Union Minister for Law and Justice to the Chief Justice of India in course of the National Consultation for strengthening the Judiciary towards reducing pendency and delays held on 24-10-2009, cases of dishon- oured cheques were cited among one of the major bottlenecks in the criminal justice system."
        },
        {
            "text": "28. In Para 2 under the heading \"the Action Plan\" it was stated as follows:\n     \"2. Identification of bottlenecks: clearing the system       1. Studies have shown that cases under certain statutes and area of law are choking dockets of magisterial and spe- cialised courts, and the same need to be identified.\n      2."
        },
        {
            "text": "The bottlenecks shall be identified as follows:\n      (a) Matrimonial cases."
        },
        {
            "text": "He relied upon Raghunath Rai Bareja v. Punjab National Bank (2007) 2 SCC 230.\n33."
        },
        {
            "text": "When any such application is made it is the duty of the court to call such person to the court for the purpose of being examined.\""
        },
        {
            "text": "The decision in Naib Din (2001) 8 SCC 578 was rendered in a totally different context and the issue before the Court was not, whether on being summoned on the application made by the accused, the person giving evidence on affidavit must begin his deposition with examination-in- chief."
        },
        {
            "text": "43. In Gurbachan Singh v. Satpal Singh (1990) 1 SCC 445 the Court was called upon to consider whether Section 113-A of the Evidence Act that created a presumption as to abetment of a suicide by a married woman would operate retrospectively or prospectively."
        },
        {
            "text": "The Court held:\n     \"37."
        },
        {
            "text": "It is profitable to refer in this connection to Halsbury's Laws of England, 4th Edn., Vol. 44, p. 570 wherein it has been stated that:\n     '922. Presumption against retrospection."
        },
        {
            "text": "The general rule is that all statutes, other than those which are merely declaratory, or which relate only to matters of procedure or of evidence, are prima facie prospective, and retrospec- tive effect is not to be given to them unless, by express words or necessary implication, it appears that this was the intention of the legislature.'\n     38."
        },
        {
            "text": "It has also been stated in the said volume of Halsbury's Laws of England at p. 574 that:\n     '925. Statutes relating to procedure or evidence."
        },
        {
            "text": "The presumption against retrospection does not apply to legisla- tion concerned merely with matters of procedure or of evidence; on the contrary, provisions of that nature are to be construed as retrospective unless there is a clear indication that such was not the intention of Parliament.' \" \n     (emphasis added)\n44."
        },
        {
            "text": "The High Court was fully conscious that Section 145(1) does not provide for the accused to give his evidence, like the complainant, on affidavit."
        },
        {
            "text": "45. In para 29 of the judgment, the High Court observed as follows:\n     \"It is true that Section 145(1) confers a right on the complainant to give evidence on affidavit."
        },
        {
            "text": "It does not speak of similar right being conferred on the accused."
        },
        {
            "text": "The legislature in their wisdom may not have thought it proper to in- corporate the word 'accused' with the word 'complainant' in sub-section (1) of Section 145 in view of the immunity conferred on the accused from being compelled to be a witness against himself under Article 20(3) of the Constitution of India....\""
        },
        {
            "text": "\nThen in para 31 of the judgment it observed:\n     \"... Merely because, Section 145(1) does not expressly permit the accused to do so, does not mean that the Magistrate cannot allow the accused to give his evidence on affidavit by applying the same analogy unless there is just and reasonable ground to refuse such permission."
        },
        {
            "text": "I find no justified reason to refuse permission to the accused to give his evidence on affidavit subiect to the provisions contained in Sections 315 and 316 of the Code \"\n46."
        },
        {
            "text": "In Union of India v. Deoki Nandan Aggarwal 1992 Supp (1) SCC 323, (1992) 19 ATC 219 this Court sounded the note of caution against the court usurping the role of legislator in the guise of interpretation."
        },
        {
            "text": "The Court observed:\n     \"14...."
        },
        {
            "text": "It is not the duty of the court either to enlarge the scope of the legislation or the intention of the legislature when the language of the provision is plain and unambiguous."
        },
        {
            "text": "The court cannot rewrite, recast or reframe the legis- lation for the very good reason that it has no power to legislate."
        },
        {
            "text": "The power to legislate has not been conferred on the courts."
        },
        {
            "text": "The court cannot add words to a statute or read words into it which are not there."
        },
        {
            "text": "Assuming there is a defect or an omission in the words used by the legislature the court could not go to its aid to correct or make up the deficiency."
        },
        {
            "text": "Courts shall decide what the law is and not what it should be."
        },
        {
            "text": "The court of course adopts a construction which will carry out the obvious intention of the legislature but could not legislate itself."
        },
        {
            "text": "But to invoke judicial ac- tivism to set at naught the legislative judgment is subversive of the constitutional harmony and comity of instrumentalities.\""
        },
        {
            "text": "50. In Raghunath Rai Bareja v. Punjab National Bank (2007) 2 SCC 230 while observing that it is the task of the elected representatives of the people to legislate and not that of the Judge even if it results in hardship or inconvenience, the Supreme Court quoted in affirmation, the observation of Justice Frankfurter of the US Supreme Court which is as follows:\n     \"41."
        },
        {
            "text": "As stated by Justice Frankfurter of the US Supreme Court (see 'Of Law and Men: Papers and Addresses of Felix Frankfurter'):\n     'Even within their area of choice the courts are not at large."
        },
        {
            "text": "They are confined by the nature and scope of the judi- cial function in its particular exercise in the field of interpretation."
        },
        {
            "text": "They are under the constraints imposed by the judicial function in our democratic society."
        },
        {
            "text": "As a matter of verbal recognition certainly, no one will gainsay that the function in construing a statute is to ascertain the meaning of words used by the legislature."
        },
        {
            "text": "To go beyond it is to usurp a power which our democracy has lodged in its elected legislature."
        },
        {
            "text": "A Judge must not rewrite a statute, nei- ther to enlarge nor to contract it."
        },
        {
            "text": "Whatever temptations the statesmanship of policy-making might wisely suggest, construction must eschew interpolation and evisceration."
        },
        {
            "text": "He must not read out except to avoid patent nonsense or internal contradiction.\" \"\n51."
        },
        {
            "text": "In Duport Steels Ltd. v. Sirs (1980) 1 WLR 142, (1980) 1 All ER 529 (HL) Lord Scarman expounded the legal position in the following words: (WLR p. 168 G-H: All ER p. 534)\n     \"But in the field of statute law the Judge must be obedient to the will of Parliament as expressed in its enactments."
        },
        {
            "text": "In this field Parliament makes, and unmakes, the law: the Judge's duty is to interpret and to apply the law, not to change it to meet the Judge's idea of what justice requires."
        },
        {
            "text": "Interpretation does, of course, imply in the interpreter a power of choice where differing constructions are possible."
        },
        {
            "text": "But our law requires the Judge to choose the construc- tion which in his judgment best meets the legislative purpose of the enactment."
        },
        {
            "text": "If the result be unjust but inevitable, the Judge may say so and invite Parliament to reconsider its provision."
        },
        {
            "text": "But he must not deny the statute.\""
        }
    ]
}