{
    "STA": [
        {
            "text": "It upheld the claim observing as follows:\n     \"... Merely because, Section 145(1) does not expressly permit the accused to do so, does not mean that the Magistrate cannot allow the accused to give his evidence on affidavit by applying the same analogy unless there is just and reasonable ground to refuse such permission."
        },
        {
            "text": "The extent of the right of the accused under Section 145(2) of the Act: whether the right of the accused is limited to cross-examination of any person giving evidence on affidavit or is it open to the accused to insist that notwith- standing the evidence earlier given on affidavit, on coming to the court the complainant or his witness should first give deposition in examination-in-chief before being cross-examined by him?"
        },
        {
            "text": "9. The first amendment inserted Chapter XVII in the Act, comprising Sections 138 to 142."
        },
        {
            "text": "Section 138 made, for the first time in the legislative history of the country, the issuance of a cheque by any person in discharge of any debt or liability owed by him to its holder, that was not honoured by the banker because of insuffi- ciency of funds in the account, a penal offence for the drawer that would make him liable to punishment with imprisonment that might extend to one year (now, two years after the second amendment with effect from 6- 2-2003) or with fine that might extend to twice the amount of the cheque or both; the four clauses of the pro- viso then laid down the preconditions to attract the section, as safeguards for the honest drawer."
        },
        {
            "text": "11. The Statement of Objects and Reasons appended to the Bill explaining the provisions of the new Chapter stated as follows:\n     \"This clause [Clause (4) of the Bill] inserts a new Chapter XVII in the Negotiable Instruments Act, 1881."
        },
        {
            "text": "The provi- sions contained in the new Chapter provide that where any cheque drawn by a person for the discharge of any lia- bility is returned by the bank unpaid for the reason of the insufficiency of the amount of money standing to the credit of the account on which the cheque was drawn or for the reason that it exceeds the arrangements made by the drawer of the cheque with the bankers for that account, the drawer of such cheque shall be deemed to have committed an offence."
        },
        {
            "text": "In that case, the drawer, without prejudice to the other provisions of the said Act, shall be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to twice the  punishable with imprisonment for a term which may extend to one year, or with fine which may extend to twice the amount of the cheque, or with both."
        },
        {
            "text": "\n     The provisions have also been made that to constitute the said offence:\n     (a) such cheque should have been presented to the bank within a period of six months of the date of its drawal or within the period of its validity, whichever is earlier; and      (b) the payee or holder in due course of such cheque should have made a demand for the payment of the said amount of money by giving a notice, in writing, to the drawer of the cheque within fifteen days of the receipt of the information by him from the bank regarding the return of the cheque unpaid; and      (c) the drawer of such cheque should have failed to make the payment of the said amount of money to the payee or the holder in due course of the cheque within fifteen days of the receipt of the said notice."
        },
        {
            "text": "\nIt has also been provided that it shall be presumed, unless the contrary is proved, that the holder of such cheque re- ceived the cheque in the discharge of a liability."
        },
        {
            "text": "Such safeguards are:\n     (a) that no court shall take cognizance of such offence except on a complaint, in writing, made by the payee or the holder in due course of the cheque;\n     (b) that such complaint is made within one month of the date on which the cause of action arises; and      (c) that no court inferior to that of a Metropolitan Magistrate or a Judicial Magistrate or a Judicial Magistrate of the First Class shall try any such offence.\"\n12."
        },
        {
            "text": "6. The Bill seeks to achieve the above objects.\"\n     (emphasis added)\n19."
        },
        {
            "text": "summarily.(1)"
        },
        {
            "text": "Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), all offences under this Chapter shall be tried by a Judicial Magistrate of the First Class or by a Metropolitan Magistrate and the provisions of Sections 262 to 265 (both inclusive) of the said Code shall, as far as may be, apply to such trials:\n     "
        },
        {
            "text": "Provided further that when at the commencement of, or in the course of, a summary trial under this section, it ap- pears to the Magistrate that the nature of the case is such that a sentence of imprisonment for a term exceeding one year may have to be passed or that it is, for any other reason, undesirable to try the case summarily, the Magistrate shall after hearing the parties, record an order to that effect and thereafter recall any witness who may have been examined and proceed to hear or rehear the case in the manner provided by the said Code."
        },
        {
            "text": "\n     (2) The trial of a case under this section shall, so far as practicable, consistently with the interests of justice, be con- tinued from day to day until its conclusion, unless the court finds the adjournment of the trial beyond the following day to be necessary for reasons to be recorded in writing."
        },
        {
            "text": "\n     (3) Every trial under this section shall be conducted as expeditiously as possible and an endeavour shall be made to conclude the trial within six months from the date of filing of the complaint."
        },
        {
            "text": "\n     144. Mode of service of summons.(1) Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), and for the purposes of this Chapter"
        },
        {
            "text": ", a Magistrate issuing a summons to an accused or a witness may direct a copy of summons to be served at the place where such accused or witness ordinarily resides or carries on business or personally works for gain, by speed post or by such courier services as are approved by a Court of Session."
        },
        {
            "text": "\n     (2) Where an acknowledgment purporting to be signed by the accused or the witness or an endorsement purported to be made by any person authorised by the Postal Department or the courier services that the accused or the wit- ness refused to take delivery of summons has been received, the court issuing the summons may declare that the summons has been duly served."
        },
        {
            "text": "\n     145. Evidence on affidavit.(1) Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), the evidence of the complainant may be given by him on affidavit and may, subject to all just exceptions be read in evidence in any enquiry, trial or other proceeding under the said Code."
        },
        {
            "text": "\n     (2) The court may, if it thinks fit, and shall, on the application of the prosecution or the accused, summon and ex- amine any person giving evidence on affidavit as to the facts contained therein."
        },
        {
            "text": "146. Bank's slip prima facie evidence of"
        },
        {
            "text": "certain facts.-The court shall, in respect of every proceeding under this Chapter, on production of bank's slip or memo having thereon the official mark denoting that the cheque has been dishonoured, presume the fact of dishonour of such cheque, unless and until such fact is disproved."
        },
        {
            "text": "\n     147. Offences to be compoundable.-Notwithstanding anything contained in the Code of Criminal Procedure, 1973 (2 of 1974), every offence punishable under this Act shall be compoundable.\""
        },
        {
            "text": "\n22. Sub-section (2) of Section 143 mandates that the trial would proceed, as far as practicable, on a day-to- day basis and sub-section (3) of the section requires the Magistrate to make the endeavour to conclude the trial within six months from the date of filing of the complaint."
        },
        {
            "text": "\n24. Section 146, making a major departure from the principles of the Evidence Act provides that the bank's slip or memo with the official mark showing that the cheque was dishonoured would by itself give rise to the presumption of dishonour of the cheque, unless and until that fact was disproved."
        },
        {
            "text": "We may also make it clear that Section 137 of the Evidence Act does not define \"examine\" to mean and include the three kinds of examination of a witness; it simply defines examination-in-chief, cross-examination and re-examina- tion\"."
        },
        {
            "text": "What Section 145(2) of the Act says is simply this."
        },
        {
            "text": "The court may, at its discretion, call a person giving his evidence on affidavit and examine him as to the facts contained therein."
        },
        {
            "text": "34. As a matter of fact, Section 145(2) expressly provides that the court may, if it thinks fit, summon and ex- amine any person giving evidence on affidavit."
        },
        {
            "text": "(2001) 8 SCC 578 dealing with Section 296(2) of the Code made the following observation:\n     \"8. ... If any party to a lis wishes to examine the deponent of the affidavit it is open to him to make an application before the court that he requires the deponent to be examined or cross-examined in court."
        },
        {
            "text": "This is provided in sub- section (2) of Section 296 of the Code."
        }
    ]
}